{
  "posts": [
    {
      "fileName": "2010-03-29-prep-e3-2010.md",
      "slug": "getting-the-most-out-of-e3-expo-2010",
      "title": "Getting the most out of E3 Expo 2010",
      "date": "2010-03-29T18:36:45.000Z",
      "tags": [
        "business",
        "conference",
        "pitch"
      ],
      "description": "Preparing for E3 Expo and other video game industry conferences to make the most of your video game pitch and meetings",
      "built_excerpt": "Well, it's almost here, E3 Expo 2010 and it will be followed by many other opportunities to get out there and network: Game Connection, Develop, Gamescom, and if you're lucky, Tokyo Game Show, etc. Over the years, I've attended my of these events as both someone pitching and someone listening to other peoples pitches and I have a few tips to share. By now, you've obviously spent a lot of time, effort and money carefully preparing your pitch and polished your presentation. You've no doubt booked a flight, hotel, got some spending money and need to feed yourself and probably some clients too. Your team have packed you off with some good wishes and are waiting for you to let them know how it went. You may have family waiting on you too. All of this is a massive commitment and you've got a lot riding on it. Start with"
    },
    {
      "fileName": "2010-05-26-avoiding-contract-pitfalls-royalties.md",
      "slug": "avoiding-game-development-contract-pitfalls-royalties",
      "title": "Avoiding Game Development Contract Pitfalls - Royalties",
      "date": "2010-05-26T19:39:00.000Z",
      "tags": [
        "business",
        "contract",
        "royalties"
      ],
      "built_excerpt": "Here at @simeonpashley we like to clear some of the fog surrounding the more complex business of making games. Negotiating contracts can be tough, and there's a lot to think about but don't let some of the most important elements slip you by. Getting these right can make the difference between scraping by and living well and it's not easy if you lack experience but we're here to help. I'll start by going through some common elements of royalty clauses. ** ** I'd like to start out by saying always take professional legal advice before signing a contract, the information below is my opinion only based on experience. Is it worth it? YES! There's a myth that it's pretty much impossible to achieve royalties on anything but the killer AAA multi-million selling items but I've seen many cases where the route to success is often in being aware of"
    },
    {
      "fileName": "2010-06-03-quote-gift-is-to-giver-and-comes-back.md",
      "slug": "quote-the-gift-is-to-the-giver-and-comes-back-to-him-walt-whitman",
      "title": "Quote – The gift is to the giver, and comes back to him… – Walt Whitman",
      "date": "2010-06-03T11:24:00.000Z",
      "tags": [
        "games"
      ],
      "built_excerpt": "There is real satisfaction to be had in giving someone a gift and making a difference in their day and you ask nothing in return. Do you give little metaphorical gifts in your work or your games? Little bonus items people aren't expecting?"
    },
    {
      "fileName": "2010-06-04-5-top-tips-from-freelance-programmer.md",
      "slug": "5-top-tips-from-a-freelance-game-programmer",
      "title": "5 Top Tips from a Freelance Game Programmer",
      "date": "2010-06-04T08:30:00.000Z",
      "tags": [
        "career",
        "freelance",
        "guest",
        "programmer"
      ],
      "built_excerpt": "I recently reconnected with an old friend who's been a Freelance Game Programmer for many years, I asked him what advice he could give to someone just starting out and here's his top tips: I particularly like his ethos: \"value-for-money &#x26; minimum hassle\", because contractors/freelancers have a general reputation for being otherwise (Expensive &#x26; demanding) Rhys Twelves, 12 Code Monkeys Ltd, UK http://uk.linkedin.com/in/rhystwelves Here's Rhys' reply: The only real tips I have are:- 1. If you can, try to avoid VAT registration due to the overhead of quarterly returns, and the VAT man being able to audit you more readily.(unless you employ someone to sort this all out) 2. Get a good accountant, they are worth their weight in gold, as they know what you can/cannot claim for as a legitimate business expense, and give could advice as to where to invest your profits. 3. Make yourself as flexible as"
    },
    {
      "fileName": "2010-06-04-quote-any-fool-can-make-things-complex.md",
      "slug": "quote-any-fool-can-make-things-complex-it-takes-a-genius-to-make-things-simple",
      "title": "Quote - Any fool can make things complex, it takes a genius to make things simple.",
      "date": "2010-06-04T14:09:00.000Z",
      "built_excerpt": "'nuff said."
    },
    {
      "fileName": "2010-06-09-why-you-should-minimum-viable-product.md",
      "slug": "why-you-should-use-minimum-viable-product-game-production",
      "title": "Why you should use Minimum Viable Product game production",
      "date": "2010-06-09T02:40:29.000Z",
      "tags": [
        "lean",
        "mvp",
        "production"
      ],
      "built_excerpt": "The term Minimum Viable Product (MVP) has recently come to be used in the world of video game production but what does it mean and how can it benefit our games and the gamers themselves, including how to get the feedback you need. The phrase Minimum Viable Product is a product development and release methodology pioneered by Eric Ries as part of a long series about Lean Startup companies. Its main tenet is the development and early release of only the core of your product, allowing the marketplace to vet and feedback on its pros and cons. While the developer still has a roadmap of their own, risk is mitigated as feature has an already receptive audience and the product offering more tightly focused when the core is released early and iterated upon often, in response to real customer feedback. [caption id=\"attachment_54\" align=\"aligncenter\" width=\"300\" caption=\"Minimum Viable Product\"][/caption] Rapid Iteration The"
    },
    {
      "fileName": "2010-06-10-improve-pitch.md",
      "slug": "how-to-improve-your-video-game-pitch",
      "title": "How To Improve Your Video Game Pitch",
      "date": "2010-06-10T11:45:04.000Z",
      "tags": [
        "business",
        "conference",
        "pitch"
      ],
      "description": "How To Improve Your Video Game Pitch",
      "built_excerpt": "I've seen my game pitches in my time, and I've made quite a few myself but I'm continually amazed and just what some people think they're doing. Think about all those poor saps who've been sent to the slaughter on \"X Factor\" for our amusement when they totally and utterly fail to deliver anything that a mother wouldn't love. Think about all those sorry ideas you've seen on Dragon's Den that are just pitiful. But it doesn't have to be this way... When I've been on the receiving end, it often feels like \"X Factor\", the person pitching stands up, stumbles to introduce themselves and then proceeds to claim they've got the best thing you've ever seen, all their friends and colleagues have seen it and they're passionate about it. It's the next GTA, or God Of War, or Forza...and then....sitting on the edge of my seat I wait...out comes"
    },
    {
      "fileName": "2010-06-12-weekend-reading-12jun2010.md",
      "slug": "weekend-reading-12jun2010",
      "title": "Weekend Reading - 12/Jun/2010",
      "date": "2010-06-12T19:38:48.000Z",
      "tags": [
        "read me"
      ],
      "description": "Artist, Antony Ward's artwork appears has appeared in many games over the years and always looks amazing. He's written some books too and they're a good read for the artists out there.",
      "built_excerpt": "As the editor of @simeonpashley I love to hear from you and share the brilliant things I find from other game development linchpins I discover. I've recently updated the site book shelf with books I recently discovered from an amazing computer graphic artist Simeon used to work with, Antony Ward. His work appears has appeared in many games over the years and always looks amazing. His books are in the Authors I Know section and well worth a read if you're into discovering how to start and improve your high-end character art. I'm not an artist myself but I think that Antony's work clearly shows that he really knows what he's doing and produces some amazing art. You can view more of Antony's computer graphic work via his online blog &#x26; portfolio http://www.ant-online.co.uk/ Or contact him via Twitter @ant_ward or his tips section @3dtwips I also look forward to learning"
    },
    {
      "fileName": "2010-06-15-why-has-multiformat-games-development-become-so-problematic.md",
      "slug": "why-has-multiformat-games-development-become-so-problematic",
      "title": "Why has multiformat games development become so problematic?",
      "date": "2010-06-15T11:45:16.000Z",
      "tags": [
        "production"
      ],
      "description": "Why has multiformat games development become so problematic?",
      "built_excerpt": "With release dates slipping as titles need 'further development time' and louder groans from coders regarding the trials of contemporary CPUs, we look at how the increasingly contradictory nature of development – with studios asked to make one game for a variety of different machines – has impacted the industry… ...are the opening lines from an this old video game production article I contributed to a few years for Develop Mag about video game production issues. \"Mike Cook\" is actually Game Production Legend \"Mike Cox\" as the author got his name wrong. :) Read the full article below, including me waffling on about multi-platform video game development. Posted: Thursday, 3rd January 2008 at 9:38 am With release dates slipping as titles need 'further development time' and louder groans from coders regarding the trials of contemporary CPUs, we look at how the increasingly contradictory nature of development – with studios"
    },
    {
      "fileName": "2010-06-16-how-to-get-the-most-from-social-game-reviews.md",
      "slug": "how-to-get-the-most-from-social-game-reviews",
      "title": "How To Get The Most From Social Game Reviews",
      "date": "2010-06-16T20:04:54.000Z",
      "tags": [
        "business",
        "marketing"
      ],
      "description": "How To Get The Most From Social Game Reviews",
      "built_excerpt": "In the second part of the series on Leveraging Social Media To Maximise Your Game Sales, I'll expand on the previous article and cover the topic of useful easily getting Real Feedback, which already exists and you don't need to do anything to make it happen! This article started out with the intent of covering quite a lot of aspects but one particular point expanded out and warranted it's own article in the series...scraping Amazon. The rest will have to wait for another article, read on... Pro Reviews - a tiny voice In recent years, review scores on metacritic have really driven game development as we chase a high score through compelling game design, amazing visuals and killer content. It's quite common to find incentives for the team or business attached to reaching a certain metacritic score Here's an example from a game I worked on, notice the 107 reviews"
    },
    {
      "fileName": "2010-06-17-what-really-defines-a-social-game.md",
      "slug": "what-really-defines-a-social-game",
      "title": "What Really Defines A Social Game?",
      "date": "2010-06-17T11:45:36.000Z",
      "tags": [
        "design"
      ],
      "description": "What Really Defines A Social Game? Can I Have My Ball Back?",
      "built_excerpt": "Social Games are a bit like a ball, they're inert when they're in the garage and not much fun on when your on your own*. The more people there are the better the ball does it's job and the more people have fun. Then you're at the World Cup in South Africa in 2010! It's ultimately not about the ball but none of that fun would happen without it. Sound familiar? This is your game so lets explore what really defines a social experience. *unless you're John Farnworth. What I've learned This is a question I often wonder about as I've been working with truly social games from a number of years now and it really takes some consideration to make sure you're hitting a few fundamental points to be successful. Here's what I think makes for a successful social game. I've learned a lot these last few years whilst"
    },
    {
      "fileName": "2010-06-20-javascript-treegrid-control.md",
      "slug": "javascript-treegrid-control",
      "title": "Javascript TreeGrid control",
      "date": "2010-06-20T14:39:24.000Z",
      "built_excerpt": "JavaScript TreeGrid control aimed to organize and edit information in grid, tree, or treegrid modes.-Link. 10 things every good web developer should know – Link. Web Design and development process chart – Link. Web Design criticism – a how to – guidelines for constructive web design criticism from Smashing Mag – Link. How to hire a great graphic designer – Business Insider War Room – Link. jbgallery is a UI widget webpage written in javascript on top of the jQuery library. Its function is to show a single big image, multiple images, multiple galleries, slideshows, as a site's background, in a \"dialog\" mode or as a common pop-up. – Link. 30 web based applications useful for web designers – Link. A web designer needs a good method for delivering designs. Instead of using email attachments, PPTs and PDFs here is a fresh new way – Link. jQuery news ticker –"
    },
    {
      "fileName": "2010-06-21-generalist-specialist-game-developer.md",
      "slug": "generalist-or-specialist-game-developer",
      "title": "Generalist or Specialist game developer?",
      "date": "2010-06-21T11:45:45.000Z",
      "tags": [
        "career"
      ],
      "description": "Generalist or Specialist game developer?",
      "built_excerpt": "Whilst researching teams, I recently came across 2 similar concepts that describe the skills of people working in your beloved game development industry - \"T-Shaped\" people and \"Generalising Specialist\". I wanted to know more about them and how these types relate to my experience of people and if the idea gives me something for me to learn. The shape of the letter is a nice way to visualise someones skill with the horizontal stroke ' ' referring to the breadth of someones skills and the vertical '|' referring to how skilled they are in that particular skill. Therefore, \"T-Shaped\" people have a principal skill that describes the vertical leg of the 'T', they're multi-player level designers, script writes, AI programmers or shader artist. However, they have a broad understanding of how things fit together and can branch out into other skills when required although this may not be their strongest"
    },
    {
      "fileName": "2010-06-21-jquery-heatmap.md",
      "slug": "jquery-heatmap",
      "title": "jQuery heatmap",
      "date": "2010-06-21T14:38:22.000Z",
      "description": null,
      "built_excerpt": "A jQuery heatmap – Link. jQuery Formlabels plugin – Link. In search of the one true layout – CSS based layouts – Link. EJS TreeGrid is a DHTML component written in pure JavaScript to display and edit data in table, grid, tree view, tree grid or Gantt chart on HTML page – Link. Also see this MaxTreeGrid."
    },
    {
      "fileName": "2010-06-21-whats-your-point-of-difference.md",
      "slug": "whats-your-point-of-difference",
      "title": "What's your point of difference?",
      "date": "2010-06-21T22:03:18.000Z",
      "tags": [
        "business",
        "career"
      ],
      "built_excerpt": "Bear with me on this one...I'm currently sat watching a TV programme in the UK called 'Mary Queen Of Shops', which is of particular interest because they're focusing on a business I know near my house. The programme features Mary, who goes into a failing local business and revamp it into something much more successful. Why am I writing about it? What on earth has it got to do with video game development? I felt compelled to write something while the programme is still on air I can't help but draw similes from this program when comparing small indie games (local shops) and AAA budget games (supermarkets). The message here is that it's absolutely pointless for the indies to try to be the big guys, you'll never win them at a game that they control. You don't have the budgets and backing they do but it doesn't mean you can't"
    },
    {
      "fileName": "2010-06-23-comment-full-analysis-of-iphone-economics-it-is-bad-news-and-then-it-gets-worse.md",
      "slug": "comment-full-analysis-of-iphone-economics-it-is-bad-news-and-then-it-gets-worse",
      "title": "Comment - Full Analysis of iPhone Economics - it is bad news. And then it gets worse",
      "date": "2010-06-23T13:19:17.000Z",
      "tags": [
        "business",
        "iphone"
      ],
      "built_excerpt": "I recently re-tweeted this article and I commented on the post but wanted to bring the discussion here to see what you think. Full Analysis of iPhone Economics - it is bad news. And then it gets worse http://communities-dominate.blogs.com/brands/2010/06/full-analysis-of-iphone-economics-its-bad-news-and-then-it-gets-worse.html The piece opens with I promised to return with the full analysis of the iPhone App Store economics analysis, from every angle, with all data I have managed to find. This blog intends to paint the most accurate picture of the specifically Apple related iPhone App Store market economics - and lessons from here should apply to most other smart phone app stores as well. The one final piece of the puzzle that had been missing, that we desperately needed to ge the full, honest picture, was the Apple official revenue number, which we finally got a few days ago, at $1.43B total revenues generated over 2 years, and thus $1B"
    },
    {
      "fileName": "2010-06-25-5-indie-games-developers.md",
      "slug": "spotlight-5-indie-games-developers",
      "title": "Spotlight - 5 Indie Games Developers",
      "date": "2010-06-25T11:43:32.000Z",
      "tags": [
        "business"
      ],
      "description": "This week we turn the spotlight on 5 Indie Games Developers. Do you agree? Should you be in this list?",
      "built_excerpt": "The phrase 'indie games' often refers to games made by small independent developers, who fund the game themselves and release it out into the wild but self-publishing. After all, they're not bound to a publisher and therefore independent. I would also like to remind our readers that the vast majority of games you buy are made by indie developers but they rarely get the credit they deserve as their publishers mask their existence in the name of promoting their own brand. Here's a list of 5 indie game developers, in no particular order, that you may have missed on your travels around the world through the likes of the XNA Creator community or PC developers in general. It's hard to discover PS3 indies as they're often hidden behind closed doors but I try. ThatGameCompany Journey ThatGameCompany are making the transition from a small indie game developer and are in limbo"
    },
    {
      "fileName": "2010-06-26-linchpin-manifesto.md",
      "slug": "linchpin-manifesto",
      "title": "Linchpin Manifesto",
      "date": "2010-06-26T17:46:27.000Z",
      "tags": [
        "read me"
      ],
      "description": "The Linchpin manifesto holds shows some of the things I hold dear and try to act on every day. I'm sure these apply to you too.",
      "built_excerpt": "Yes. Now. I am an artist. • I take initiative • I do the work, not the job. • Without critics, there is no art. • I am a Linchpin. I am not easily replaced. • If it's never been done before, even better. • The work is personal, too important to phone in. • The lizard brain is powerless in the face of art. • I make it happen. Every day. • Every interaction is an opportunity to make a connection. • The past is gone. It has no power. The future depends on choices I make now. • I own the means of production—the system isn't as important as my contribution to it. • I see the essential truth unclouded by worldview, and that truth drives my decisions. • I lean into the work, not away from it. Trivial work doesn't require leaning. • Busywork is too easy."
    },
    {
      "fileName": "2010-06-28-maximise-your-developer-evolution.md",
      "slug": "maximise-your-developer-evolution",
      "title": "Maximise your Developer Evolution",
      "date": "2010-06-28T11:45:41.000Z",
      "tags": [
        "career"
      ],
      "description": "I've watched many developers and people make the wrong decisions they need to make to maximise their potential. I hope this post gives you a broader view on the nature of choosing your physical location within the games industry and the impact it has.",
      "built_excerpt": "Well, the inevitable has happened and by the time you're reading this I'll have traveled 250 miles to start the next phase of game development career in Guildford, the hub of game development in the UK. This prompted me to reflect on how things have gone over the last few years and what advice I can give. Why do I think that migrating to a game development hub is inevitable? Because you cannot makes games in a vacuum and both your career and your business need talent to feed on or you will starve. (BTW pretty much all of my posts are scheduled, but don't tell anyone) I have long supported game development throughout the whole of the UK and Europe along with it's self-sufficient pockets but ultimately the larger your studio becomes or the further your career progresses the more you need to have access to talented people and"
    },
    {
      "fileName": "2010-06-30-three-ways-to-zap-stress-during-crunch.md",
      "slug": "guest-post-three-ways-to-zap-stress-during-crunch",
      "title": "Guest Post – Three Ways to Zap Stress During Crunch",
      "date": "2010-06-30T11:45:35.000Z",
      "tags": [
        "career",
        "Stress"
      ],
      "description": "In a guest post by Mike Reeves-McMillan, he helps you cope with the inevitable stress that comes with making video games. ",
      "built_excerpt": "Stress is a fact of 21st-century life, and all the more so when you're working on big, high-pressure projects. I've worked in a projects environment for most of the past 20 years, and I know how it gets. You start to become irritable, forgetful, you may find yourself dreaming about work, you're tired but you can't sleep well, you might even start to find loud noises and bright lights painful. It's not fun. Basically, what's happened is that what is meant to be a short-term response for getting you out of immediate physical danger, increasing your concentration and memory and awareness of your environment, has kept firing off over a long period, and now those exact responses are getting worn out - as if you'd kept lifting a weight with the same hand, over and over, until your muscles get fatigued and stop working properly. So what can you do?"
    },
    {
      "fileName": "2010-07-03-game-development-social-media-partnership.md",
      "slug": "blog-game-development-social-media-partnership",
      "title": "Blog - Game Development Social Media Partnership",
      "date": "2010-07-03T16:40:15.000Z",
      "built_excerpt": "Fellow Game Development bloggers We all know that after writing a great post and hitting the publish ?button we're not even halfway finished! There can be a seemingly endless marketing job to do by submitting a ?blog article to various social bookmarking sites like Digg, ?StumbleUpon and Delicious. We can also choose to submit to social ?networking sites like LinkedIn and Facebook. But after we've done this there is no way of knowing that our efforts ?have paid off! The article will sometimes sit on the bookmarking site with just ?one vote and therefore unseen by the majority of the ?site's visitors. Here's where the Game Development Social Media Partnership Google Group comes in… Promote your fantastic posts! After you have written your blog post you can post the link and ask people to vote, bump, ?thumbs up, or generally big up your post. Maybe you can provide the ?"
    },
    {
      "fileName": "2010-07-05-games-service-what-it-means.md",
      "slug": "games-as-a-service-do-you-really-know-what-it-means",
      "title": "Games As A Service: Do You Really Know What It Means?",
      "date": "2010-07-05T11:45:51.000Z",
      "tags": [
        "business",
        "design",
        "production"
      ],
      "description": "Games As A Service: Do You Really Know What It Means?",
      "built_excerpt": "I was looking at the schedule for Develop Conference 2010 ( @developconf2010 ) to see if there was anything I should pick up on regarding game production and development and I've spotted a couple of tasty things that I have experience so I thought I'd jump the gun and share a little before July comes along. Some of the content we've seen before from prior conferences and here's what I've learned: Games As A Service: Do You Really Know What It Means? Online games have been around for a while now and we all know the key mantra \"It's a service, not a product.\" Or do we? Very often, in the haze of development, teams may lose their focus from this truth; especially as the concept of service is not that clearly defined to begin with. As well as fleshing out the concept of Online Game Service, this lecture will"
    },
    {
      "fileName": "2010-07-06-what-can-we-learn-from-location-based-games.md",
      "slug": "what-can-we-learn-from-location-based-games",
      "title": "What can we learn from location based games?",
      "date": "2010-07-06T16:00:10.000Z",
      "tags": [
        "design"
      ],
      "built_excerpt": "Location based games have really taken off in the last year or so and they're only going to get better but do those ideas have to be constrained to gps devices? Can you do location based game play on a fixed console such as ps3? For a while now I've enjoyed using the likes of SCVNGR, Gowalla and FourSquare to discover new places and share tips. I've also enjoyed the game side of these, in particular 4SQ badges and Mayorships. For those that don't know about these the badges are much like achievements or trophies you find on console and are awarded for doing something extraordinary such as the 'Jobs' badge for visiting 3 Apple stores or one for visiting a pub on a \"school night\" or one for travelling on a boat+train+plane. Whilst these are using rewards were used to seeing on consoles the potential of something like Mayorships"
    },
    {
      "fileName": "2010-07-07-using-odesk-for-seo-tasks.md",
      "slug": "using-odesk-for-seo-tasks",
      "title": "Using Odesk For SEO Tasks",
      "date": "2010-07-07T14:32:40.000Z",
      "description": null,
      "built_excerpt": "SEO or search engine optimization is a technique used to rank up high in Google. Deciding to hire a search engine optimizer is a big decision that can potentially improve your website, as well as, help you save valuable time, money and benefit your internet business further. If you're thinking of hiring freelancers to do SEO tasks such as link building and article writing, then you may consider oDesk freelancers. oDesk freelancers can provide clients with valuable service and it is advisable doing SEO earlier to get maximum benefits. The best time to hire is when you're planning a site redesign, or considering to launch a new site. That way, you and your SEO can make certain that your site is designed to be optimally search-engine friendly from the bottom up. Also, a good SEO can help develop good websites content. Competent employees are considered lifeblood of any business and"
    },
    {
      "fileName": "2010-07-09-10-incredible-css-resources.md",
      "slug": "10-incredible-css-resources",
      "title": "10 Incredible CSS Resources",
      "date": "2010-07-09T14:31:01.000Z",
      "built_excerpt": "CSS is becoming a very popular part of web design these days. Most designers now offer CSS design as a part of their services, and even amateur designers are learning all they can about CSS. The best part about Cascading Style Sheets is that the pages load quickly and the layout it very easy to change. So if you are looking for some tips, tricks, and cheats for CSS, the list below should help you out. 1. CSS Level 2 Revision 1 For those who feel they can tackle the technical language, this site is the place to learn all you need to know about CSS. Those who are new to CSS can still benefit from this, although it might take a bit of work. Reading over the sections a few times, then attempting to complete CSS designs, and then re-reading the instructions is a great way to become familiar"
    },
    {
      "fileName": "2010-07-09-all-games-should-be-free.md",
      "slug": "all-games-should-be-free",
      "title": "All games should be free!",
      "date": "2010-07-09T11:47:02.000Z",
      "tags": [
        "design"
      ],
      "description": "hy iPhone and iPad developers should stop moaning about the sale price of their games",
      "built_excerpt": "(mobile post) Theres a debate raging over on LinkedIn about protecting the relatively high price of iPad apps when compared to iPhone apps and i have to say i disagree. I got so far as: Games should be free! Why would I say this even though I derive a living from games along with many thousands of other game developers? Because it's entirely possible to make money from 'free' games with a caveat that some aspects of the experience can be embellished, enhanced or sped up at a price. OK, I suppose I exaggerated the first point but I think you understand the point I'm making. :) This freemium model has been proved to work time and time again but the old guard want to protect the old ways. Sadly the traditional locked game design is lazy as the current thinking about freemium requires just that, some thinking. Notice I"
    },
    {
      "fileName": "2010-07-12-are-you-good-enough-to-make-3d-games.md",
      "slug": "are-you-good-enough-to-make-3d-games",
      "title": "Are you good enough to make 3D games?",
      "date": "2010-07-12T11:45:37.000Z",
      "tags": [
        "business",
        "career"
      ],
      "description": "Making 3D games requires a top-flight design, code and art team. Do you have what it takes?",
      "built_excerpt": "If you're going to be looking to make 3D games, you're going to need the best programmers you can find, or strip your artwork down to nothing. I'm sure you're familiar with the basic tech: you wear glasses that control which eye sees the view from a slightly different angle giving the illusion of 3D. There is of course a massive technical consideration for 3D games, that they have 1/2 your frame rate as you're now rendering twice as much as you were before. (This is a gross assumption based on the fact that you're render bound) Those beautiful silky games that did run at 60fps, drop a frame and you're now run at 30fps tops (2 frames at 60fps). There is no 50fps or 40fps, it's straight down to 30fps. The next jump down is 20fps (3 frames at 60 fps) and it goes on from there but in"
    },
    {
      "fileName": "2010-07-15-develop-2010-is-over.md",
      "slug": "develop-2010-is-over-next-up-gamescom",
      "title": "Develop 2010 is over, next up Gamescom",
      "date": "2010-07-15T23:05:22.000Z",
      "tags": [
        "conference"
      ],
      "built_excerpt": "Well, it looks like Develop 2010 is over for this year (the clue is in the name) and the next event is Gamescom in just over 4 weeks time. Just enough time to detox ready for the next wave of 'networking'. :) I wonder if Paul the Psychic Octopus predicted the correct Develop Award winners? It looks like he's patrolling the Gamescom web-site too, so BEWARE! Stick with us during the break and don't go changing channels!"
    },
    {
      "fileName": "2010-07-16-everything-you-need-to-know-about-video-game-production.md",
      "slug": "everything-you-need-to-know-about-video-game-production",
      "title": "Everything you need to know about Video Game Production",
      "date": "2010-07-16T11:44:14.000Z",
      "tags": [
        "production"
      ],
      "description": "In the upcoming series I'll cover everything you need to know about Video Game Production. The whole story including a happy ending.",
      "built_excerpt": "By special request I'm going to dig deep and put together a series of posts on Video Game Production, covering the whole cycle from end-to-end to hopefully share some of the knowledge I've acquired over the years and get your feedback too on what you think. This will include elements from numerous training courses and also hard-earned best practice learned from doing the job and working with amazing people. Don't miss out: join the RSS stream or follow us on Twitter and be ready. Tell your friends to join too. I'll aim to cover the following topics in the series: Game Production - 1000ft view The Plan The Team The Business Understanding the Team Implementation: Design, Code, Art, Audio and more Support: Operations, HR, finance, legal and more Stakeholders: Publishers, Platform Holders Game Concept Key elements to include in your thinking Genre, Platform, Market Documentation Game: GDD, TDD, Plan, Risk"
    },
    {
      "fileName": "2010-07-18-how-i-use-twitter.md",
      "slug": "how-i-use-twitter",
      "title": "How I use Twitter",
      "date": "2010-07-18T23:40:37.000Z",
      "tags": [
        "business"
      ],
      "built_excerpt": "(mobile post) There's an interesting post over on GameProducer.net about how Juuso uses Twitter as part of his game blog that I wanted to emulate here. I use my @simeonpashley Twitter feed largely to auto-post new articles from this blog. This is done automatically when I hit publish so it's the best way to keep up-to-date. Simply follow us and you're all set. I also follow other people in the games industry, not companies, and join in chats there and also RT (re-tweet) anything I find interesting and relevant to game development. I also follow events such as #e3expo, #develop2010 and #gamescom and RT interesting items too. As Juuso says, you really need a client to use Twitter as the basic web service really doesn't scratch the surface of what's possible. I use Tweetdeck on my iPhone, Home Mac and work PC as it's by far the best app. I"
    },
    {
      "fileName": "2010-07-19-how-to-make-documents-work-for-your-team.md",
      "slug": "how-to-make-documents-work-for-your-team",
      "title": "How To Make Documents Work For Your Team",
      "date": "2010-07-19T17:12:08.000Z",
      "tags": [
        "production"
      ],
      "description": "All video game development need documents and here are some tips to ensure your documents are read, acted on and kept up-to-date.",
      "built_excerpt": "All video game production projects need documents, whether it's a four page description for an iPhone game, Xbox Live Indie Game, Flash game or a 65-doc library for a AAA multi-million selling game on PS3, X360 and every other platform. On all video game development projects, similar problems come up: people don't read documentation, people read documentation but find them confusing, documentation don't get updated or the updates don't get acted on. Fortunately, there are some ways you, as a game designer (or as whoever's writing a doc) can help. Make it readable Documentation that isn't read is worse than not having the documentation at all because (a) game designer time is wasted writing it and (b) the game design team assumes the other teams know what they're doing, when they're actually relying on other methods, like reading tea leaves. Game developers are busy people: it isn't easy to convince"
    },
    {
      "fileName": "2010-07-20-the-implications-of-youtube-being-the-second-largest-search-engine.md",
      "slug": "the-implications-of-youtube-being-the-second-largest-search-engine",
      "title": "The Implications of YouTube Being The Second Largest Search Engine",
      "date": "2010-07-20T11:28:33.000Z",
      "description": null,
      "built_excerpt": "You tube has become the second largest search engine in recent years. It helps the viewers to get the exact idea of your product or the services you offer through the internet. It not only helps to drag the traffic towards your site, but also makes bulk revenue for you. This tool is highly efficient to give a specification to your web page. It is the best way to express your ideas and the thoughts about the creativity. It not only gives you the recognition, but it pays your share of profit. It is very easy to access and even a beginner finds it very convenient. If you are planning to generate some income through the YouTube, then it is suggested that you register the site and Google Adsense. This is the mode of payment that is used by YouTube. After you register your account, the next step includes of"
    },
    {
      "fileName": "2010-07-30-fellow-game-bloggers.md",
      "slug": "fellow-game-bloggers",
      "title": "Fellow Game Bloggers",
      "date": "2010-07-30T16:55:43.000Z",
      "tags": [
        "business"
      ],
      "built_excerpt": "I've collected a list of all of the video game bloggers I've found so far. These cover a broad range of topics include developers, producers, artists, designers, business and I'd wholly recommend adding them all to your favourite RSS reader. A Great Becoming... About everything and the rest Avant Game Broken Toys Computer Games Doolwind's Game Coding Blog Eating Bees Evidence-Based Design FreeToPlay.biz - Adrian Crook Game Producer Blog Game Tycoon GameArchitect.Net Games Brief Games from Within gameslol HobbyGameDev Mainly About Games Measuring Gameplay - article Over00 Plot is Gameplay's Bitch Psychochild's Blog Raph's Website Reality Panic RULES OF THE GAME Sulka's Game T=Machine The Daedalus Project The Forge Wonder Arcade Wonderland Zen of Design"
    },
    {
      "fileName": "2010-07-31-interview-game-developer-programmer-stuart-harrison.md",
      "slug": "interview-with-a-veteran-video-game-developer-1",
      "title": "Interview with a Veteran Video Game Developer \\#1",
      "date": "2010-07-31T12:54:10.000Z",
      "tags": [
        "interview"
      ],
      "description": "Find out what a 15 year video game developer has to say.",
      "built_excerpt": "I recently circulated a few questions to some veteran video game developers I know about their experience and their insight into video game development. The 1st response I received is from Stuart Harrison who has been programming games since 1995. Stuart is currently a Lead Programmer at Sony Computer Entertainment and continues to be a top game developer. I'd like to thank Stuart for his contribution and please read on to find out what Stuart had to say... Join In If you've been making video games for more than 5 yrs simply send me your answers to the questions below along with a little bio and I'll happily post good responses. I look forward to hearing from you What inspired you to start developing games? Doom! In fact, I think it was Doom's vast (and probably unintended) 3rd party editing utilities that got me hooked. I was even credited with"
    },
    {
      "fileName": "2010-08-10-can-i-help-you.md",
      "slug": "can-i-help-you",
      "title": "Can I Help You?",
      "date": "2010-08-10T20:01:28.000Z",
      "tags": [
        "business",
        "indie games"
      ],
      "description": "I can help you make a better game by providing feedback on your design or work-in-progress game.",
      "built_excerpt": "I am frequently contacted by video game developers asking me for help in a couple of areas, some just want some feedback, some are asking me for financial investment to make their game a reality. Maybe your one of these people, or maybe you'd like some critique of your work? I'm currently looking for 1 other developer to mentor and devote some real attention to, should this be you? I'm happy to say that in many cases I provide assistance and make a difference with their games and help re-direct them towards a more prosperous future by providing them with not only advice on the games themselves but also how to make them, what potential opportunities they have for revenue streams and even help them find a publisher. Basically, help out on which ever aspect of their game they need. The only bit I don't do is actually make it."
    },
    {
      "fileName": "2010-08-14-20-years-of-a-video-game-developer-career.md",
      "slug": "20-years-of-a-video-game-developers-career-part-1",
      "title": "20 years of a Video Game Developer's Career - Part 1",
      "date": "2010-08-14T15:20:53.000Z",
      "tags": [
        "career"
      ],
      "description": "Making a long-term career in video game development takes effort and planning, here's an insight into what I've done so far",
      "built_excerpt": "Since a young age I've always had an interest in making computer games and I've been very fortunate to have supportive parents who worked hard to get what I now understand to be very expensive bits of hardware over the years. I thought I'd share some background of how I ended up where I have today with some luck and some foresight... I used to spend hours lurking around the only computer shop for miles around, playing with the Jupiter Aceand the ZX80 in the shops marvelling at what they could do. I was extremely fortunate to get a Sinclair ZX81 for Christmas one year but it didn't come with any way of getting games into it other than the usual way of typing in listings from magazines such as Sinclair User. I learned a tremendous amount during this period as I played around and adapted these early programs into"
    },
    {
      "fileName": "2010-08-19-20-years-of-a-video-game-developer%e2%80%99s-career-%e2%80%93-part-2.md",
      "slug": "20-years-of-a-video-game-developers-career-part-2",
      "title": "20 years of a Video Game Developer's Career – Part 2",
      "date": "2010-08-19T18:26:54.000Z",
      "tags": [
        "career"
      ],
      "description": "this week we delve a little deeper on how we used to make video games before networks",
      "built_excerpt": "I follow on from Part 1 of this series with some more information on how I got where I am today in the video game development community. Most of the old stuff is irrelevant but I hope it shares the need to actively plan your career to avoid some development cul-de-sacs. Let's continue... I wrapped up the previous post where I'd pretty much reached a point where I recognised a need to get a grip of my own career and make some long-term plans, after all, no-one else was going to do this for me and this wasn't going to happen overnight. Of course, this was all based on assumption that everything else would stay the same in that the way games were being made wouldn't change too much and we all know how wrong that assumption was. I'm not going to talk specifically about the games I've made as"
    },
    {
      "fileName": "2010-08-25-20-years-of-a-video-game-developer-career-3.md",
      "slug": "20-years-of-a-video-game-developers-career-part-3",
      "title": "20 years of a Video Game Developer's Career – Part 3",
      "date": "2010-08-25T11:45:13.000Z",
      "tags": [
        "career"
      ],
      "description": "Part 3 of the series continues the saga of my career through the turbulent times during the transition from PS1 to PS2.",
      "built_excerpt": "I'd like to share with you my game development career experience as part of a series of posts, the 1st parttalked about my early career and I followed up with a second postthat was more about how those games were made. Let's get back on track with the series and rejoin the fun back when the transition for PS1 to PlayStation 2 was happening. Krisalis v2 a.k.a Teque Software After a long and fruitful period of key game development the rest of the world was moving over to PlayStation 2 but we were still making games for PS1. It wasn't for lack of effort and respect, indeed I attended many exclusive PS1 &#x26; Saturn developer conferences across the globe. Over the years, the PS1 conferences were held in a variety of amazing locations including secret clubs and even in the middle of the top-secret high-speed ring at Millbrook Proving Grounds."
    },
    {
      "fileName": "2010-08-25-is-a-game-development-career-compatible-with-family-life.md",
      "slug": "is-a-game-development-career-compatible-with-family-life",
      "title": "Is a game development career compatible with family life?",
      "date": "2010-08-25T13:50:18.000Z",
      "tags": [
        "career"
      ],
      "description": "What compromises have you made to balance your career and family?\\r\\n",
      "built_excerpt": "I've been following the thread over on Luke's blog entitled 'Goodbye, Realtime Worlds' and I've commented in there when the discussion turned to the collateral effects that being made redundant has in an industry that's so sparsely spread around the globe. The discussion isn't about overtime in the short-term, it's more about long-term careers in games when you've got other people to think about in your life. Maybe your partner has a great job, maybe you've got other businesses you're involved with, maybe you've got children? It got me wondering what everyone else's experience is like. What compromises have you made to balance your career and family?"
    },
    {
      "fileName": "2010-08-26-why-does-redundancy-happens-in-game-development.md",
      "slug": "why-does-redundancy-always-happen-in-game-development",
      "title": "Why Does Redundancy Always Happen In Game Development?",
      "date": "2010-08-26T12:16:28.000Z",
      "tags": [
        "business",
        "career"
      ],
      "description": "Redundancies are a natural consequence for an independent studio when they finish a project. What happens when the project ships? What do all of these people do? As much as we'd like to believe that 100% of the team have meaningful work, it's not going to be the case.",
      "built_excerpt": "It's worth understanding why redundancies are a natural consequence for an independent studio when they finish a project. Firstly, it's important to understand that the end of the project is always the point when the team is the largest, QA come onboard, people are generally added to get the project delivered to a high enough quality. So, what happens when the project ships? What do all of these people do? As much as we'd like to believe that 100% of the team have meaningful work, it's not going to be the case. With the best will in the world a studio will plan follow-on revenue generating work but it's incredibly rare that this work magically dove-tails into utilising 100% of the available team, or even a reasonable chunk of the team. Support work, patching and concepting future projects may all soak up some people but all of this work is"
    },
    {
      "fileName": "2010-08-30-when-the-production-manager-visits.md",
      "slug": "when-the-production-manager-visits",
      "title": "When The Production Manager visits",
      "date": "2010-08-30T12:22:02.000Z",
      "tags": [
        "fun",
        "manager"
      ],
      "built_excerpt": "This is what it feels like when the production manager visits to see how you're game is doing..."
    },
    {
      "fileName": "2010-09-03-avoiding-redundancy-2.md",
      "slug": "avoiding-redundancy-2",
      "title": "Avoiding Redundancy 2",
      "date": "2010-09-03T17:00:07.000Z",
      "tags": [
        "business",
        "career",
        "redundancy"
      ],
      "description": "Let's put the redundancy post in context and explore the topic a little more.",
      "built_excerpt": "I very recently wrote a post entitled 'Why Does Redundancy Always Happen In Game Development?' that kinda hit the spot with a few people and I think it needs more context so I thought it worthwhile giving a separate update. It's a tough topic to discuss and it always has negative connotations but it's a fact of life and ignoring it and not being prepared is a bad thing. I can totally see how the provocative title and lack of context could have riled some people so here's some context. Redundancy is obviously a real and horrible event that happens and it can be mitigated by properly running a business but it's largely inevitable. My recent experience is based around running mid to large-scale teams of 30-80 people across multiple projects and the level of commitment that goes with that. My focus is on quality, delivery and profitability of all"
    },
    {
      "fileName": "2010-09-06-epic-citadel-lean-mean-development.md",
      "slug": "epic-citadel-lean-mean-development",
      "title": "Epic Citadel - lean, mean development",
      "date": "2010-09-06T11:17:04.000Z",
      "tags": [
        "development",
        "iphone",
        "middleware",
        "unreal"
      ],
      "built_excerpt": "The recent outing on iPhone of the amazing looking Unreal Engine 3 demo entitled Epic Citadel (available free) by Epic really shows the underlying capability of the hardware that current mobile devices have. In short, it's like nothing you've seen on any iOS device so far. But is it all good for game developers? I'm reminded when I see such apparent wonders of technology that actually, this is what most developers can achieve if they're prepared to go as low down in the API as they can, right down the HAL if possible. The closer you get, the more layers of noisy slow API you get past and the more precious CPU &#x26; GPU time you get to spend on your content. I'm also reminded of the fat, lazy techniques that it's easy to get away with when you've got a lot of CPU &#x26; GPU power to play"
    },
    {
      "fileName": "2010-09-07-a-warm-fuzzy-feeling.md",
      "slug": "a-warm-fuzzy-feeling",
      "title": "A warm fuzzy feeling",
      "date": "2010-09-07T11:21:49.000Z",
      "tags": [
        "legacy"
      ],
      "description": "It's nice to get comments on games made ages ago",
      "built_excerpt": "I always get a warm fuzzy feeling when I get to know that people enjoyed the games I made all those years ago...in today's world it's relatively easy to find people who were previously shrouded in mystery and you could never reach them. Do you connect with people who make things you enjoy? Arabian Knights (via satansam@YouTube) Just a little message to say this game was one of the staple games of my childhood. There was one level I could never get past, I think it was on a pirate ship... by that point in the game I had no lives left so it was a struggle for a 10 year old xD. But yea. You programmed a brilliant game. Every part of that game was well made, the controls, the music, the artwork. Great stuff. So with that in mind, cheerio!"
    },
    {
      "fileName": "2010-09-17-20-years-of-a-video-game-developer%e2%80%99s-career-%e2%80%93-part-4.md",
      "slug": "20-years-of-a-video-game-developers-career-part-4",
      "title": "20 years of a Video Game Developer's Career – Part 4",
      "date": "2010-09-17T17:07:44.000Z",
      "tags": [
        "career",
        "history",
        "LinkedIn"
      ],
      "built_excerpt": "I'd like to share with you my game development career experience as part of a series of posts, let's rejoin the story at during the twilight days of PlayStation 2 when I started at Kuju in Sheffield. I've included a lot of photos in this post so you may even make an appearance! Kuju Sheffield v1 I was fortunate to be have formed strong relationships with people across the industry and I was brought in as employee #2 for the newly formed Kuju studio in Sheffield where the next phase of my career began including many of the people I'd worked with in Leeds on the emerging platforms. Kuju had recently been listed on the stock market and was expanding rapidly with studios in Guildford, London, Brighton and now Sheffield. Starting out at Kuju Sheffield was an exciting time, there were essentially 4 of us in the 1st few weeks"
    },
    {
      "fileName": "2010-09-20-excellent-tips-and-resources-for-web-design.md",
      "slug": "6-excellent-tips-and-resources-for-web-design",
      "title": "6 Excellent Tips and Resources for Web Design",
      "date": "2010-09-20T14:14:05.000Z",
      "built_excerpt": "Web design is a whole new type of design. You still follow many of the design rules that apply to print designs like brochures or posters. However, web design presents new possibilities and new challenges that brochure printing will never see. Here are some tips and resources to help with those new challenges and possibilities. Use a Neat and Tidy Template Your page layout has a lot to do with the usability of any web page. This list from psd.tutsplus will show you some templates that will optimize the design of your web pages in the same way templates can be chosen for optimal brochure printing. Or check out this article that gives some incredible resources for improving HTML and CSS codes. Make Your Site Easily Navigable In order for your users to feel at ease on your website, they will need to be able to find their way around."
    },
    {
      "fileName": "2010-09-22-flow-make-better-games.md",
      "slug": "flow-make-better-games",
      "title": "Flow - Make Better Games",
      "date": "2010-09-22T11:45:35.000Z",
      "tags": [
        "LinkedIn",
        "production",
        "productivity"
      ],
      "description": "Working in a state of Flow is both productive and pleasing. You should foster and support it's existence for a happy team and game.",
      "built_excerpt": "I've been meaning to re-present something I did for a whole game development studio a while back about 'Flow'. It instantly improved production and was something we held dear as a team. Have you ever said anything like: \"Wow, is it that time already?\" \"Sorry, I was miles away\" \"I get my best work done when everyone's gone home!\" If the answer is yes, then you've experienced a state of Flow and most likely been incredibly productive. It's sometimes called being \"in the zone\" too among others. Here's my take on a well-known psychological state and why it's important to game developers. Flow is a highly productive state of mind, time slips by and you blitz through work, making fewer mistakes, no thought about how much effort your making and generally higher quality thinking goes into it too. \"Flow is a condition of deep, nearly meditative involvement. In this state,"
    },
    {
      "fileName": "2010-10-01-the-definitive-guide-to-pitching-your-video-game.md",
      "slug": "the-definitive-guide-to-pitching-your-video-game",
      "title": "The Definitive Guide To Pitching Your Video Game",
      "date": "2010-10-01T11:00:57.000Z",
      "tags": [
        "LinkedIn",
        "pitch",
        "pitching"
      ],
      "built_excerpt": "Over the years I've both pitched many games and been on the receiving end of pitches too, all of which range from a small game worth £100k up to AAA hits of close on £10M. I've worked my way through the good &#x26; bad and I wanted to share with you my complete guide to pitching a game. In essence, Pitching is about building a bridge between the Art and the Money, let's learn how to make that bridge**.** In order to make this connection we need 3 key elements to be successful. These are: A Great Idea A Good Business Case and a Great Team to execute it A Warning What's presented in this post are general rules that work in most cases but these aren't definitive rules, you'll need to adapt them to suit your own needs but the principles are sound and are well-tested. I also focus"
    },
    {
      "fileName": "2010-10-03-my-favourite-ios-music-apps.md",
      "slug": "my-favourite-ios-music-apps",
      "title": "My Favourite iOS Music Apps",
      "date": "2010-10-03T12:01:41.000Z",
      "tags": [
        "iphone",
        "music"
      ],
      "built_excerpt": "I've spent a little while this week whiling away the hours with a couple of music related apps for iPhone / iPad I'd recommend you check-out. Perfect for a Sunday morning. BIT.TRIP BEAT I saw a video of BIT.TRIP being played over on YouTube and it looked exactly like my kind of game. It look fun and furious with a great graphic style all of its own. I had to have it! BIT.TRIP BEAT is the arcade game for the new millennium, fusing Pong with interactive beats. Use the accelerometer or touch controls to move the paddle up and down bouncing beats back from which they came! Listen and react to different beat progressions as you try to survive an onslaught of spectacular retro visuals. Successfully chain beats and obtain the megasphere to go for insane scores, not to mention the elusive \"Perfect Score.\" Team-up with your friends for the"
    },
    {
      "fileName": "2010-10-04-episodic-game-content-done-right.md",
      "slug": "episodic-game-content-done-right",
      "title": "Episodic Game Content Done Right",
      "date": "2010-10-04T11:45:54.000Z",
      "tags": [
        "business model",
        "episodic",
        "LinkedIn"
      ],
      "built_excerpt": "I think there's a missed opportunity with Episodic games that are currently being launched, they're largely just about delivering a known experience over an extended period of time and splitting the costs throughout each episode. There's very little focus on the user experience and, more importantly, the social experience that episodic content can repeatedly deliver. I think they key to this is engaging everyone in a simultaneous and recurring experience, like a TV show. Imagine a chapter of a story driven game like Halo Reach being made available for everyone to play at 8pm on the 1st Sunday of every month, just one chapter, no-one can play it before that time so everyone experiences the same event. It could even be that this chapter is only available to play for a fixed period too, if you missed the event then you've got to wait for a repeat or get yourself"
    },
    {
      "fileName": "2010-10-05-whats-going-on-with-sony-android-and-google.md",
      "slug": "whats-going-on-with-sony-android-and-google",
      "title": "What's going on with Sony, Android and Google?",
      "date": "2010-10-05T11:38:03.000Z",
      "tags": [
        "LinkedIn"
      ],
      "built_excerpt": "Yesterday we witnessed Google TV open it's web-doors and it reminded me of a common thread between Sony and Google. Nov 2009 saw Sony announce it was releasing a Xperia phone using Android OS May 2010 saw Sony announce the first TV to feature Google TV, it's a fair guess that it's running a variant of Android. \"I am delighted to announce the unique alignment of Google's rapidly growing, open source Android platform with Sony's unparalleled expertise in the field of TV design and technology.\" - Sony's Chairman, CEO and President, Sir Howard Stringer In addition to this alignment there's also lots of rumours about things you'd associate with an Android device: Aug 2010 rumours around Gamescom about Rear Touch, whilst Rear touch isn't specific to Android, touch alone is something we've not seen on a Sony device. Sept 2010 - PlayStation looking for Android developers. This could be anything"
    },
    {
      "fileName": "2010-10-11-best-spam-filters-for-wordpress.md",
      "slug": "4-of-the-best-spam-filters-for-wordpress",
      "title": "4 of the Best Spam Filters for WordPress",
      "date": "2010-10-11T14:09:09.000Z",
      "built_excerpt": "When a blog receives lots of comments, it is a sign that the blog is a popular one among visitors. On the flip side, a blog with spam comments looks unprofessional. You can either spend your days deleting all of the spam that your WordPress blog is sure to receive, or you can leave the majority of the work up to spam filters. There are a lot of options out there for WordPress spam filters, but the following are some of the most popular that you may want to try. Akismet Automatic Kismet (Akismet for short) is very well liked by all who need spam blocked from their blogs. You can get it as a WordPress plugin or you can go straight to Akismet.com to download this spam filter. Keep it updated and you will enjoy a spam-free blog space. As Akismet gets to know your site, it will be"
    },
    {
      "fileName": "2010-10-11-ring-alpha-uno-military-sim-2.md",
      "slug": "ring-alpha-uno-military-sim",
      "title": "Ring Alpha - Uno & Military Sim",
      "date": "2010-10-11T06:31:04.000Z",
      "built_excerpt": "Here's a couple of recent posts from my alter ego, Ring Alpha, about the recent web development I've been doing recently. These are exciting times and the move away from games is welcome right now given how bad 2010 has been, here's looking forwards to 2011. Turn based military javascript game 'Uno' – Online Accounting Software"
    },
    {
      "fileName": "2010-10-11-ways-to-remote-test-your-website-for-usability.md",
      "slug": "5-ways-to-remote-test-your-website-for-usability",
      "title": "5 Ways to Remote Test Your Website for Usability",
      "date": "2010-10-11T11:12:16.000Z",
      "built_excerpt": "The usability of your website can be measured to an extent. There are programs that will test the usability or you can use people to test it. Remote testing allows you to find trouble spots on your website so that you can fix them. Let's say that you have a website the specializes in brochures. You need to know if your users understand how to order brochure printing on your website. Otherwise, you could be losing valuable customers with a difficult to use website. Here are few ways to remote test your website. 1. Have someone you know test out your website while you screen share This can be a very good way to test your website usability. Find a friend or coworker who is honest and helpful. Have them visit your website while you are screen sharing and on the phone with them. As they look over your website,"
    },
    {
      "fileName": "2010-10-12-where-the-money-goes.md",
      "slug": "where-the-money-goes",
      "title": "Where The Money Goes",
      "date": "2010-10-12T11:28:08.000Z",
      "built_excerpt": "I wanted to share with you a presentation about Where The Money Goes that is received from making video games. I made this presentation a few years ago to a game development studio I was running at the time and I believe everyone found it useful and gained a better understanding of where the money that comes into the business goes before it pays their wages and why 'when' it comes in is important too. I've updated this post since then with more up-to-date principles, information and costs as I learn new things ever day. These are general principles that apply to any business and I'm going to cover the basics to hold on tight, feel free to ask me any questions in the comments section. Breaking out where the money goes My initial motivation for writing this post was to answer a question I'd long since asked myself when"
    },
    {
      "fileName": "2010-10-16-early-days.md",
      "slug": "early-days",
      "title": "Early days",
      "date": "2010-10-16T18:34:30.000Z",
      "built_excerpt": "Over the last few weeks I've been ramping up my efforts to get my teeth into all these prototypes I've got milling around, most of which are linked from my homepage. They work but they're not really manageable or agile from a development perspective. Prototypes All of the prototypes exist in one form or another, most are in a playable form but none of them are what I'd consider publishable so they need quite a bit of work on them yet. They certainly don't have good artwork that will come by me joining with a great artist nor the design finesse that comes from playing the game and working with smart game designers. Tools &#x26; Tech I'm focusing on my tech &#x26; tools right now and I've tidied up lots of the legacy bits &#x26; bobs, things I threw in just to test out if I liked an idea once"
    },
    {
      "fileName": "2010-10-16-hesketh.md",
      "slug": "hesketh",
      "title": "Hesketh",
      "date": "2010-10-16T06:36:30.000Z",
      "tags": [
        "game"
      ],
      "built_excerpt": "Play, Create, Share and Perform your own music using this simple to use tool. Built from the ground up with performance and sharing in mind, your friends will love your music."
    },
    {
      "fileName": "2010-10-26-practical-ways-to-improve-website-readability.md",
      "slug": "practical-ways-to-improve-website-readability",
      "title": "Practical Ways to Improve Website Readability",
      "date": "2010-10-26T14:08:13.000Z",
      "built_excerpt": "A readable website will encourage your viewers to remain on your website longer and investigate your content further. Perhaps they will even come back and maybe share your website with their friends. The alternative, unfortunately, is an unreadable website to which viewers get annoyed and promptly leave, never to return. Here are some easy ways to avoid this catastrophe and make your website more readable. Keep your pages clean. Do not try to stuff your pages with unnecessary junk. Image backgrounds, flashing ads, and pop up distractions to ruin the point of the page. Instead, use a solid contrasting background and font. Keep entire viewing experience will be much improved with fewer distractions. Stick to the standard. When someone picks up a brochure to browse, they look inside for the bulk of the text and on the back for contact information. Just as with brochure printing, websites need to contain"
    },
    {
      "fileName": "2010-10-28-precisely-how-to-add-content-material-to-a-joomla-website.md",
      "slug": "precisely-how-to-add-content-material-to-a-joomla-website",
      "title": "Precisely how To Add Content material To A Joomla Website",
      "date": "2010-10-28T16:45:03.000Z",
      "built_excerpt": "I will teach you how one can make pages with static content. To begin with, make sure you log in to your web site Administration Area. Then choose Content --> Article Manager. At the same time, it is possible to click on Article Manager icon in your Administration home website page. Within Article Manager you might discover a list of your web site content webpages. But if your in the beginning stages this might be a listing of most of the default Joomla articles. You are able to select the checkbox on the left, pick the ones you don't need published, next on the top right, press \"unpublish.\" To design a new web page, mouse click New at the top right of the webpage. At this point you are on a website page where you may produce your content. You will see certain fields: *Title: Give the website page a"
    },
    {
      "fileName": "2010-12-05-where-have-i-been.md",
      "slug": "where-have-i-been",
      "title": "Where have I been?",
      "date": "2010-12-05T13:03:06.000Z",
      "built_excerpt": "It's been quite a long time since I posted about Game Production as I've been focusing my efforts on my new venture 'Ring Alpha' where I'm currently focusing on making my own video games and collaborating with other indie developers around the world. It's pretty obvious that the UK games industry has been in a massive state of flux for the last 2 years and there's no sign of this slowing down anytime soon. I've been caught in the midst of this shift and personally suffered a few times this year but it's not stopped me yet. Right now I have lost faith in the large traditional companies who are really struggling to redirect their oil-tanker like ideas and my only desire is to work with Indie developers right now. We've seen the fallout from these changes and there have been massive lay-offs this year as we've seen some of"
    },
    {
      "fileName": "2010-12-15-top-link-cloaking-plugins-for-wordpress-2.md",
      "slug": "top-link-cloaking-plugins-for-wordpress",
      "title": "Top Link Cloaking Plugins for WordPress",
      "date": "2010-12-15T11:51:42.000Z",
      "built_excerpt": "If you have a blog with affiliated link hijacking. It does not matter if you are writing about poster printing or computer programing, this is problem that every blogger will face. In order to prevent someone else from taking the money for your affiliated your site. There are many plugins available for WordPress, but here are some of the best. Pretty Link If you want to mask your affiliated come from your own domain, tack clicks from emails, and spread forums and comments on blogs, then Pretty Link is the best option for you. You can also upgrade to Pretty Link Pro so that you can have the capability to automate your Pretty Link creation. WP Marketer WP Marketer is a free plugin for WordPress that will manage your affiliated to manage your inventory, set up ads in posts and landing pages, or track your results. With WP Marketer, you"
    },
    {
      "fileName": "2010-12-31-ring-alpha-uno-military-sim.md",
      "slug": "ring-alpha-uno-military-sim",
      "title": "Ring Alpha - Uno & Military Sim",
      "date": "2010-12-31T14:32:22.000Z",
      "built_excerpt": "Here's a couple of recent posts from my alter ego, Ring Alpha, about the recent web development I've been doing recently. These are exciting times and the move away from games is welcome right now given how bad 2010 has been, here's looking forwards to 2011. Turn based military javascript game 'Uno' – Online Accounting Software"
    },
    {
      "fileName": "2011-01-13-tips-for-pricing-website-design.md",
      "slug": "tips-for-pricing-website-design",
      "title": "Tips for Pricing Website Design",
      "date": "2011-01-13T14:03:28.000Z",
      "built_excerpt": "If you are fairly new to the website design business, then you may be at a loss as to what to charge. If you charge too much, you may never get any clients. If you charge too little, your perceived value can be lower than your time is worth. In order to choose the right price for your services, you will need to do a little research and make a few decisions. See what others are charging You can talk to other website designers in your area to find out what they are pricing. You could also go to trade shows and converse with people. Check out the Bureau of Labor statistics to find out what other professionals are charging for services in your area. Figure out how much you want hourly Decide on an annual salary that you can live with. Then choose a realistic number of hours you"
    },
    {
      "fileName": "2011-01-21-hosting-migration-ecommerce-site.md",
      "slug": "new-hosting-service-for-mid-size-ecommerce-site",
      "title": "New Hosting service for mid-size eCommerce site",
      "date": "2011-01-21T11:54:50.000Z",
      "tags": [
        "ecommerce",
        "hosting"
      ],
      "built_excerpt": "Ring Alpha recently provide a server migration service for one of our ongoing clients, a mid-size eCommerce store with thousands of transactions going through every day. The requirement was to improve the performance and technical specification of their site ahead of Ring Alpha providing them with a new eCommerce solution. Lets find out what we did... After a number of discussions with our client, it was obvious the rapidly growing eCommerce business had grown out of their existing hosting company and were in need of a technical upgrade that could cope with their increasing number of customers. What's needed? Our first task was to evaluate what they would need out of a new server and new hosting company to enable their business to scale over the coming months. Discover the technical needs The evaluation task itself involved detailed analysis of how their existing server was currently performing at a"
    },
    {
      "fileName": "2011-02-01-ecommerce-site-approvedfood-co-uk.md",
      "slug": "ecommerce-site-approvedfoodcouk",
      "title": "eCommerce Site - ApprovedFood.co.uk",
      "date": "2011-02-01T11:06:48.000Z",
      "tags": [
        "development",
        "ecommerce",
        "website"
      ],
      "built_excerpt": "Today saw the first public showing of the eCommerce site refresh for www.approvedfood.co.uk, which we're amazingly proud of. This is an ongoing extensive web development project and encompasses replacing the existing eCommerce site, refreshing the design, revitalising the customer experience, improving security, fixing bugs and much more. This is much more than a simple reskin and it will help the thousands of daily visitors find their way around the products much easier and Approved Food get more control, data and a rapid turn-around on changes and support. One of the things we did is to incorporate greatly enhanced tracking via Google Analytics using Custom Vars, Custom Reports, Goals/Funnels and eCommerce tracking so Approved Food can find out, down to the product and user, what's working and improve areas that need attention. The site uses not only uses up-to-date visual elements to improve the experience but it also gracefully scales"
    },
    {
      "fileName": "2011-02-01-extend-the-range-of-your-home-or-business-wifi-network.md",
      "slug": "extend-the-range-of-your-home-or-business-wifi-network",
      "title": "Extend the Range of your Home or Business Wifi Network",
      "date": "2011-02-01T11:32:45.000Z",
      "built_excerpt": "I am sometimes asked how to extend the range of your home or business Wifi network using cheap hardware and the ADSL Router your ISP gave you for free and I wanted to share with you my tips. UPDATE: This also works with the D-Link DAP-1160 Wireless G Open Source Access Point/Router, although the control panel interface is different the principles still apply. Extending your home or business Wifi network can be a great solution to connect a remote set of devices like printers, home consoles, desktop computers to a Wifi enabled router that sits in another room. I have used this solution to extend physical networks into remote offices and also connecting home computers and even XBox 360 to a broader network. The key to all of this is the amazing D-Link DWL-2100AP, which you can pickup for about £55 and it's a much cheaper and tidier alternative to"
    },
    {
      "fileName": "2011-02-15-how-seo-boosts-your-page-rank.md",
      "slug": "how-seo-boosts-your-page-rank",
      "title": "How SEO Boosts Your Page Rank",
      "date": "2011-02-15T19:30:47.000Z",
      "description": "SEO, your business website will rise swiftly through the ranks, moving your online presence from the back page to front of all the competition. Here's how.",
      "built_excerpt": "Do you ever use search engines to find a product or service on the Internet, rather than physically getting in your car and driving to the local department store? You're not alone. Millions of others are doing the same every day. How often do you go beyond the first two search results pages to find what you're looking for? How about beyond the first few entries on the first page? Perhaps without realising it, you've just demonstrated know how SEO (Search Engine Optimisation) can boost the 'page rank' of your own business website. Page Ranking Determines Success What exactly is page rank? Page rank determines whether potential customers will find your business on page one of a web search, or page 1,022. The ultimate goal is for your website to be the first business listed on the first page. Generally, buyers of products and services type a specific word or"
    },
    {
      "fileName": "2011-02-16-how-to-choose-the-best-website-designer.md",
      "slug": "how-to-choose-the-best-website-designer",
      "title": "How to Choose the Best Website Designer",
      "date": "2011-02-16T11:34:54.000Z",
      "built_excerpt": "In order to compete in today's tough hospitality economy, business owners need a strong online presence. The convenience of online shopping, coupled with the high price of gasoline, means a growing number of potential customers are on the Internet right now looking for your business and dreaming of their next vacation destination. So, whether you are just beginning to sell online or want a more competitive edge for your existing business, knowing how to choose the best website designer is a crucial skill. One word of caution: when choosing the best designer for your business, never choose based on price alone. While price can be one indicator of whether the designer meets your budget needs, you may unfortunately get what you pay for, which will certainly cost you more in the long run. Hire the best designer you can afford to avoid this common and expensive mistake. Of course, paying"
    },
    {
      "fileName": "2011-03-24-mobile-web-view.md",
      "slug": "dont-miss-the-growing-mobile-web-audience",
      "title": "Don't miss the growing mobile web audience",
      "date": "2011-03-24T15:17:10.000Z",
      "built_excerpt": "Mobile purchases and mobile web viewing are increasing every day and it's simply not good enough to expect users to view your regular site. iPhone, Android and tablet viewers expect custom built views. Thankfully, all of our regular and content-managed websites take full advantage of the iPhone, iPad, Android and other devices with views and touch-based interfaces especially built to get the most out of them. Our new elegant iPad specific view is a joy to behold and features large buttons, swipe gestures and much more. Can you afford not to have a mobile website? Especially a FREE version of your existing site? Contact Us to find out how we can help. Following are some pictures of this web design site running on iPhone and iPad, I'm sure you'll agree they look very impressive. iPhone Web View iPad Web View Want to capture the growing mobile audience? Contact Us to"
    },
    {
      "fileName": "2011-03-24-ten-website-design-mistakes-to-avoid.md",
      "slug": "ten-website-design-mistakes-to-avoid",
      "title": "Ten Website Design Mistakes to Avoid",
      "date": "2011-03-24T21:30:34.000Z",
      "built_excerpt": "As the economy took a downturn and fuel prices soar, more people are turning to spending money online. But, with millions of sites competing for every customer, competition is tough, to say the least. To complicate matters, studies show that the average website visitor spends approximately 8 seconds on your site before moving onto check out your competition…unless your product or service hits 'em right between the eyes with the kind of impact that makes them want to stay and buy. To stand head and shoulders above the competition, you should know these ten business website design mistakes to avoid. With only a few seconds to convert browsing visitors into paying customers, striving to become the first --and best --destination for your products and services will be much easier if you follow these key points: Using Design Templates Dull, Drab Colors and Words Too Many Words Confusing Menus Inaccessibility; Poor"
    },
    {
      "fileName": "2011-04-07-spring-clean-your-website-to-improve-your-search-results-ranking.md",
      "slug": "spring-clean-your-website-to-improve-your-search-results-ranking",
      "title": "Spring Clean Your Website to improve your Search Results ranking",
      "date": "2011-04-07T10:18:21.000Z",
      "built_excerpt": "Keeping your website up-to-date is important to ensure you keep high in the search listings or you will be overtaken by those that do. We can help you find and fix any issues that may affect your search results position, it's never been more important to keep your website up-to-date. There have been a few recent Google announcements that are likely to affect your site if your website isn't updated to consider them. February 2011 saw Google change their search results formula and 11% of old sites disappeared off the radar, many others are sliding down the ranks. March 2011 raised the profile of Page Speed, where faster loading pages appear higher in the Search Engine Results Pages. This website scores 88 out of 100, how does yours compare? Jan-April 2011 has seen a major update of Wordpress and numerous security fixes to mitigate hacker attacks May-June 2011 will see"
    },
    {
      "fileName": "2011-04-15-ecommerce-website-developer.md",
      "slug": "ecommerce-website-developer",
      "title": "eCommerce Website Developer",
      "date": "2011-04-15T18:51:47.000Z",
      "built_excerpt": "It's fair to say that we're experienced experts in ecommerce web development having delivered multiple ecommerce websites of all sizes that serve anywhere from 100 to 90,000 customers per month and have over 1,000 products listed on Google Products. We offer a number of 'out of the box' ecommerce packages that can support your business whatever your scale now and in the future. All of our ecommerce packages are built on proven, secure, extendible eCommerce web platforms that will scale with your business. Small eCommerce websites are built on the popular Wordpress platform and can support from 1 to 100 products in multiple categories and come with a rich feature set including secure payments via PayPal or Google Checkout. Mid-size eCommerce websites are built on the proven and feature rich Magento eCommerce web platform that is used by hundreds of existing eCommerce stores around the world. Our eCommerce website is"
    },
    {
      "fileName": "2011-04-27-five-ecommerce-website-seo-tips-you-can-use.md",
      "slug": "five-ecommerce-website-seo-tips-you-can-use",
      "title": "Five eCommerce Website SEO tips you can use",
      "date": "2011-04-27T13:36:39.000Z",
      "built_excerpt": "We have a great deal of experience in Search Engine Optimisation (SEO) for eCommerce websites to improve the position of both your online store and the items you sell. We have some secret ways of doing this for your eCommerce website but we can share our most common tactics that are specific to eCommerce to genuinely improve your orders. Navigation around the eCommerce website must be easy for both Google and your customers. There are specific tasks that need to be done to ensure that you make the most of website layout to ensure your items rank highly. e.g., the URLs of the products themselves, how the categories interlink, location of your checkout. You must avoid duplicate content by ensuring that your products are unique, even if the same product exists in multiple product categories, that can be achieved with some clever use of meta tags. The website needs to"
    },
    {
      "fileName": "2011-04-30-improve-google-adwords-advertising-campaigns.md",
      "slug": "improve-google-adwords-advertising-campaigns",
      "title": "Improve Google Adwords advertising campaigns",
      "date": "2011-04-30T14:05:27.000Z",
      "description": null,
      "built_excerpt": "Managing an effective Pay Per Click advertising campaign on Google Adwords takes experience and skill to do right as there are many factors that come into play in order to really maximise your budget and effectiveness. At the time of writing every new Adwords account gets a £30 voucher to use within 15 days of the account opening so it's worth grabbing that free cash and using it will. Before you go ahead, setting up a single campaign, with 1 advert pointing at your homepage driven by lots of keywords is a sure-fire way to wasting your advertising budget but with a little effort you can make it work for you. It's important to understand how your advert will be chosen to be displayed based on the adverts content, the bid (usually automatically set) and the page on your website that the advert points to, all of these components need"
    },
    {
      "fileName": "2011-05-04-get-my-business-on-google-maps.md",
      "slug": "get-my-business-on-google-maps",
      "title": "Get my business on Google Maps",
      "date": "2011-05-04T12:18:27.000Z",
      "built_excerpt": "Getting your business on Google Maps (aka Google Places, Google Local Business) is critical for every business as search results now prioritise and display local results over regular non-map based searches, if your business isn't on the map then you're missing out on a significant amount of potential customers. UPDATE: We are now offering a service to get your business on Google Maps for only £50. Thankfully, getting on the map is a simple thing to do, it involves creating your own Google Places account and then submitting various business details such as address, contact details, categories, images, reviews and more to Google for consideration. Getting noticed is a little harder. The tough part is getting your business noticed on Google Maps, as there are more and more businesses claiming their place and competing for attention. There are various components that need to be done right or it's just a"
    },
    {
      "fileName": "2011-05-06-Is at desk internet access bad for productivity.md",
      "slug": "is-at-desk-internet-access-bad-for-productivity",
      "title": "Is at desk internet access bad for productivity?",
      "date": "2011-05-06T22:46:31.000Z",
      "built_excerpt": "I know a few development companies that do not have internet access at the staff's desk. Internet access is restricted to separate systems that are shared between multiple people and are in public areas so people can see who's on and when. One such company also has a ban on external calls at work, via the work system or your own personal mobile. I know that these are justified as being for productivity reasons, staff have their distractions removed and live in a vacuum that consists only of known work and known processes. Aside from security issues, is this really necessary? I appreciate that some people simply cannot resist procrastinating and checking up on their social networks every 1 minute but I'd also argue that at desk Internet access is as important as having electricity to your workstation. We know that it gives us access to an almost infinite array"
    },
    {
      "fileName": "2011-05-12-live-customer-support.md",
      "slug": "live-customer-support-chat-and-monitoring-of-your-website-visitors",
      "title": "Live Customer Support, chat and monitoring of your website visitors",
      "date": "2011-05-12T15:24:59.000Z",
      "built_excerpt": "Live Customer Support and Realtime Information about your website visitors is absolutely critical to improving your business online. Add Live Chat/Support to your website TODAY for ~~£100~~ only £50! Contact Us to get started straight away. UPDATE: Our clients with a small number of visitors are using this tool to chat to all of their customers while they're in a buying mood. Understand who's on your site, make your customers love you, and earn more money. Want to know who's on your website RIGHT NOW? Want to catch your customers before they abandon their basket? Chat to your customers live while they're on your website and help them find what they're looking for with a great online support tool like Olark. Integration is easy We recently integrated this into our own website and were so impressed with the results that we began to encourage our existing clients to take"
    },
    {
      "fileName": "2011-05-22-.md",
      "slug": "be-found-in-google-local-search",
      "title": "Be found in Google Local search",
      "date": "2011-05-22T10:32:47.000Z",
      "status": "draft",
      "published": false,
      "description": null,
      "built_excerpt": "Featuring in Local search results is becoming increasingly important for businesses if they intend to get customers. The major search engines, like Google, now show Place/Map listings front and center on the 1st results page and it's an ideal opportunity to either occupy more space on the front page if you're already on Page 1 or simply appearing on Page 1 in the first instance. Here are 5 simple things that can effect your Google Maps listings. Completeness &#x26; Consistency There are several fields to fill out when creating or editing and some of them may not seem like they are really necessary. Google wants to give users the best experience possible; in most circumstances the user will have a better experience if there is more information present on the Places page. This means not only filling out the required text fields but also the optional ones: Email address Website"
    },
    {
      "fileName": "2011-06-17-move-your-business-to-the-cloud.md",
      "slug": "move-your-business-to-the-cloud",
      "title": "Move your Business to the Cloud",
      "date": "2011-06-17T06:41:13.000Z",
      "tags": [
        "community",
        "facebook",
        "forum",
        "rss",
        "social media",
        "tweetdeck",
        "twitter"
      ],
      "built_excerpt": "Ring Alpha recently undertook the task of setting up and migrating a complete business over to the cloud. The task included migrating all of the User Accounts, Email, Documents, Calendars and Contacts to Google Applications for Business. If you're thinking about improving your availability, cost savings and ensuring your documents are backed up and shared then give Ring Alpha a call to see how we can help you migrate Google Applications represents significant benefits over hosting your own services and here are a few key reasons: Proven cost savings Google's web-based messaging and collaboration apps require no hardware or software and need minimal administration, creating tremendous time and cost savings for businesses. End users can use the familiar Microsoft Outlook interface for email, contacts and calendar as they transition to Gmail and Google Calendar. A leading research firm found that Google Apps is as little as 1/3 the total cost"
    },
    {
      "fileName": "2011-07-17-optimising-an-ecommerce-site.md",
      "slug": "optimising-an-ecommerce-site",
      "title": "Optimising an eCommerce Site",
      "date": "2011-07-17T18:41:27.000Z",
      "built_excerpt": "Our development work this week has included a lot of server optimisation for an eCommerce website and we dramatically improved response times, lowered overall CPU use and memory use by making changes to the server configuration. The benefit is a better experience for the Visitors, Customers and Google (page load speed is a factor in Page Rank) and it also enables the server to cope with higher volumes of visitors without becoming overloaded. All of the changes were made to the configuration of the server itself, no changes were made to the website to gain these benefits. Memory We started by improving memory use, as this was frequently consumed and caused the site to become unresponsive and on rare occasions it become unusable. The main changes came from changes to the Apache, MySQL and PHP configurations to reduce peak memory use to something the server could cope with. MySQL The"
    },
    {
      "fileName": "2012-03-28-shu-gspm-s1w9-presentation-production-methods.md",
      "slug": "game-production-methods-shu-gspm-s1w9",
      "title": "Game Production Methods - SHU GSPM S1W9",
      "date": "2012-03-28T10:15:40.000Z",
      "built_excerpt": "Below is a link to the presentation I gave at Sheffield Hallam University for the BSc (Honours) Games Software Development module Game Software Project Management about Game Development Production Methods. GPM_S1W9_Production Methods"
    },
    {
      "fileName": "2012-03-28-shu-gspm-s2w2-presentation-marketing.md",
      "slug": "traditional-game-marketing",
      "title": "Traditional Game Marketing",
      "date": "2012-03-28T10:22:47.000Z",
      "built_excerpt": "Below is a link to the presentation I gave at Sheffield Hallam University for the BSc (Honours) Games Software Development module Game Software Project Management about Traditional Video Game Marketing. GPM_S2W2_SHU_GPM_Marketing"
    },
    {
      "fileName": "2012-03-28-shu-gspm-s2w2-presentation-post-production.md",
      "slug": "game-development-post-production-shu-gspm-s2w2",
      "title": "Game Development Post Production - SHU GSPM S2W2",
      "date": "2012-03-28T11:39:30.000Z",
      "built_excerpt": "Below is a link to the presentation I gave at Sheffield Hallam University for the BSc (Honours) Games Software Development module Game Software Project Management about Post-Production. The Post-Production Cycle - Game Software Project Management from gamelinchpin presentation"
    },
    {
      "fileName": "2012-04-11-app-list.md",
      "slug": "app-list",
      "title": "app list",
      "date": "2012-04-11T00:09:31.000Z",
      "built_excerpt": "Day One.app Disk Inventory X.app Dropbox.app Skype.app Day-O.app Flux.app Hazel KeyRemap4 MacBook MenuMeters Transmission.app Twitter.app Perian VLC.app HandBrake.app Flip4Mac Google Chrome.app CodeKit.app DiffMerge.app MAMP PRO MacGDBp.app Sequel Pro.app Sublime Text 2.app Tower.app VMware Fusion.app Xcode.app iA Writer.app nvALT.app"
    },
    {
      "fileName": "2012-04-11-setting-up-osx-for-web-development-2.md",
      "slug": "setting-up-macos-for-web-development",
      "title": "Setting up MacOS for Web Development",
      "date": "2012-04-11T16:57:46.000Z",
      "built_excerpt": "(I will be maintaining this Post with my current setup steps as time moves on) I've been using MacOS for Web Development for a while now, initially on a Mac Mini, then migrating to a MacBook Pro and on to a MacBook Air. I thought it was a good idea to get my web development software setup down so I can recall it more easily and get things moving a lot more quickly when I need to re-set everything back up again. Read on to find out how. Main apps After starting from a fresh MacOS Install I usually follow up with a few default web development applications that I have stored on my local server under 'app_0' to indicate that they're the critical. XCode - install via the App Store. While it's not used for web development it is required as it includes vital system tools that others depend"
    },
    {
      "fileName": "2012-04-14-installing-jenkins-as-continuous-integration-builder-on-windows.md",
      "slug": "installing-jenkins-as-continuous-integration-builder-on-windows",
      "title": "Installing Jenkins as Continuous Integration builder on Windows",
      "date": "2012-04-14T12:37:03.000Z",
      "built_excerpt": "While most of my work is Mac/Unix based some of my business work is built on VB.NET/ASP.NET inside a Windows development. While striving for more robust, predictable code I chose to implement a Continuous Integration (CI) system. I had already used CI in large scale game production environments with great success following the TDD model. Setting up a Continuous Integration server was the 1st task and I chose Jenkins for the task in hand. This had to be setup on a Windows system so that it could invoke Visual Studio 2010 in order to build the required projects parts that were a mix of VB applications and ASP.NET web services. We also had a requirement to use Perforce as the SCM of choice. I'm assuming you already have a working build of your product on a host machine with your VS2010 build already cleanly building via a solution file. Here's"
    },
    {
      "fileName": "2012-04-23-resurrecting-a-synology-diskstation.md",
      "slug": "resurrecting-a-synology-diskstation",
      "title": "Resurrecting a Synology DiskStation",
      "date": "2012-04-23T21:08:29.000Z",
      "built_excerpt": "I walked into a minefield of problems when attempting to connect back to my Synology DS210j after a regular firmware update. The approved desktop application DSAssistant was used to upload and apply the firmware but something just went wrong. DSAssistant claimed the IP address was set, but the device wouldn't accept web connections. I eventually found a solution that helped me get the device back up &#x26; running. Background I retried to apply the firmware but during installing DSAssistant claimed to be unable to update the status and simply gave up. It advised me to check error logs via telnet but the default password is ** (despite setting this in the setup). A password won't be accepted by telnet so that just wouldn't work. I tried different firmware versions, re-downloaded old ones to remove the possibility of it being a corrupt firmware download. Nothing worked. In hindsight, I can only"
    },
    {
      "fileName": "2012-04-24-carbon-copy-cloner-osx-micro-review.md",
      "slug": "carbon-copy-cloner-macos-micro-review",
      "title": "Carbon Copy Cloner MacOS - micro review",
      "date": "2012-04-24T11:02:24.000Z",
      "built_excerpt": "Carbon Copy Cloner - micro review Carbon Copy Cloner a.k.a. CCC is a donation-ware disk duplication application for Apple Mac MacOS. I recently used the app to successfully move my data from a HDD to an SDD and I decided to give it a go as part of my regular backup system. Here's my mini review… My gripe with the app is that while the scheduled events do start on time, even waking the computer up to do so, the app doesn't keep the system awake. This means that your power settings are likely to cause your system to sleep and therefore the backup to pause in the middle. This of course means that it will resume when your computer wakes again and that will most likely be when you get back on your system in the morning to start work and be faced with the rest of the backup"
    },
    {
      "fileName": "2012-04-29-osx-reports-incorrect-disk-usage.md",
      "slug": "macos-reports-incorrect-disk-usage",
      "title": "MacOS reports incorrect disk usage",
      "date": "2012-04-29T14:05:44.000Z",
      "built_excerpt": "If you're MacOS disk usage is being reported incorrectly then you've probably got caught by a Time Machine feature introduced in Apple MacOS 10.7. This typically happens where your free disk space erodes over time or when you delete some files and yet the disk still claims to have the same space usage as before. This is a silently introduced feature where Time Machine can operate on laptops (MacBook Air / MacBook Pro) when the TM volume isn't available. The system essentially snapshots your changes for backing up later. Read about it here http://arstechnica.com/apple/reviews/2011/07/mac-os-x-10-7.ars/18 If you want to disable the feature and reclaim your space go in to Terminal and enter: sudo tmutil disablelocal **followed by return, and after entering you password and hitting return again, it should delete the local snapshots and free up the missing space."
    },
    {
      "fileName": "2012-05-05-pinterest-pin-fails-no-images-foun.md",
      "slug": "pinterest-pins-fails-to-stick",
      "title": "Pinterest pins fails to stick",
      "date": "2012-05-05T12:38:35.000Z",
      "built_excerpt": "Pinterest is a fantastic way to discover content, styles, products and ideas. As such, it's crucial that websites make it as simple as possible for their content to be 'pinned' on Pinterest. Sadly, it appears that many web developers are struggling to get their content on their due to silent errors. Many pages around the web give workarounds for clients but they don't address the issues faced by the website itself. I tried a few ways to find solutions for the websites I manage. Pinning typically fails in 2 ways: When pinning via the common 'Pin It' bookmarklet or using the onpage embedded 'Pin It' button the Image and description appear OK for the javascript pop-up but when the 'Pin This' button is pressed nothing is pinned and the dialog refreshes with no content. Directly pinning the content when on pinterest.com reveals \"We couldn't find any images\" despite the javascript"
    },
    {
      "fileName": "2012-05-07-ssh-auto-login-with-shared-key-fails.md",
      "slug": "ssh",
      "title": "SSH",
      "date": "2012-05-07T11:40:37.000Z",
      "built_excerpt": "I recently had trouble when my SSH auto-it took a while to figure out what was wrong. I've made some notes for posterity. It turned out to be SSH not being happy with the directory/file ownership and permission on both the target and client. Finding the problem When running Centos it's important to ensure that SSHD logging is on so you can discover what's wrong and also track Enable logging for sshd by editing the config file $ nano /etc/ssh/sshd_config Locate the following and make the changes: # Logging # obsoletes QuietMode and FascistLogging SyslogFacility AUTH #SyslogFacility AUTHPRIV LogLevel INFO Don't forget to restart the service to apply the changes $ /etc/init.d/sshd restart Check the logs With logging enabled you can now watch the end of the messages log where you should find the error messages. I did this with 2 boxes open. Box 1 was logged into the target"
    },
    {
      "fileName": "2013-04-17-what-i-was-responsible-for-as-studio-head.md",
      "slug": "what-i-was-responsible-for-as-studio-head",
      "title": "What I was responsible for as Studio Head",
      "date": "2013-04-17T16:28:49.000Z",
      "built_excerpt": "I'm having a bit of a dig about in some old documents and I found my old job specification for when I was Studio Head for Kuju Sheffield. Studio Head Job Summary The Studio Head has ultimate responsibility for building and maintaining a profitable business based on creating quality products in a timely manner delivered to the market through long term business partners and developed by a balanced high caliber motivated team. Studio Head (SH) Responsibilities Corporate Manage the studio as a profitable business unit. Develop the studio's Strategy working with the CEO for approval by the board. Develop the studio's Brand strategy working with the CEO for approval by the board. Develop the studio's BP working with the FD &#x26; CEO for approval by the board. Execute against the BP including responsibility for the studio's financial performance. Agree accounts with F&#x26;A in advance of monthly studio board meeting. Complete"
    },
    {
      "fileName": "2013-04-19-200-rss-feeds-from-carefully-cultivated-reading-list.md",
      "slug": "200-rss-feeds-from-carefully-cultivated-reading-list",
      "title": "200+ RSS feeds from carefully cultivated reading list",
      "date": "2013-04-19T11:30:00.000Z",
      "description": null,
      "built_excerpt": "Over the years I've found that RSS feeds have made it easier for me to keep up the latest news in my reading list. I have a carefully cultivated list of 200+ home &#x26; work related feeds that I patrol every day. Here's how to import my list for your own use. The imminent demise of Google Reader on 1st June 2013 has prompted me to find an alternative reader. To be safe I exported my reading list in OPML formatso I could take it with me (linked to this post). How can I use your reading list? Since most RSS readers sync with Google Reader you can use that as a way to get the feed setup. After which you can sync it with your favourite reader of choice Here's a quick way to use my feeds as a starting point: Download my reading list in OPML format -"
    },
    {
      "fileName": "2013-04-22-studio-policy-bible.md",
      "slug": "studio-policy-bible",
      "title": "Studio Policy Bible",
      "date": "2013-04-22T11:32:00.000Z",
      "built_excerpt": "Every business needs some policies to keep teams aware of everything they need to know and working smoothly. Here's one of our old policy documents that's a little skewed towards a game development studio but most of it should apply to most types of business A central repository for all the bits of miscellaneous policy staff should be aware of: 1. HR Policies 1.1. Please see company general HR policies, available on intranet. 1.2. Please note that your employment contract will also contain details on certain policies (e.g. working hours) 1.3. All holiday/unpaid leave etc. forms should pass up the line manager chain before final approval/rejection when they are sent to HR. Project Managers may finally approve all holiday forms themselves, without need for Exec Producer approval unless holiday is for more than 1 week in which case Exec Producer approval is still required. 1.4. All recruitment forms should pass"
    },
    {
      "fileName": "2013-04-29-job-interview-assessment-form-template.md",
      "slug": "job-interview-assessment-form-template",
      "title": "Job Interview Assessment Form Template",
      "date": "2013-04-29T11:41:38.000Z",
      "built_excerpt": "Back in the days of old, we used standard templates for a lot of company documents to ease &#x26; standardise communication throughout the business. Here's an example of a job interview form that was used to summarise an interview and share it around the various departments who needed to know various aspects. This document was often referred to through the initial probation period. Name of Candidate Jose Smith Date of Interview Thu 8^th^ May 2028 Interviewer/s Stuart Programmer, Richie Programmer Role Interviewed for: AI Programmer Results of Tests [poor, average, good] (please show your rating score if undertaken) C Test Math Test Java Test Other Skills/Knowledge [poor, average, good] Pretty good; plenty of experience with a variety of games and platforms. Communication skills [poor, average, good] English wasn't excellent, but he got his point across very well nonetheless. He was quite verbose and not at all shy about talking, which"
    },
    {
      "fileName": "2013-05-06-600-of-the-best-wordpress-plugins.md",
      "slug": "600-of-the-best-wordpress-plugins",
      "title": "600+ of the best WordPress Plugins",
      "date": "2013-05-06T12:20:00.000Z",
      "built_excerpt": "Here is a list of Wordpress Plugins that are currently very popular and well worth investigating. While I don't use all of these plugins, I do use a good few of them to bring you this Wordpress blog. Wordpress Plugins by Category Ad Management Ad Code Manager http://wordpress.org/extend/plugins/ad-code-manager/ Ad Codes Widget http://wordpress.org/extend/plugins/ad-codez-widget/ Ad Inserter http://wordpress.org/extend/plugins/ad-inserter/ Ads in Right Bottom http://wordpress.org/extend/plugins/...-right-bottom/ AdSense Manager http://wordpress.org/extend/plugins/adsense-manager/ AppAd Manager http://wordpress.org/extend/plugins/appad-manager/ Better AdSense Targeting http://wordpress.org/extend/plugins/...nse-targeting/ Custom Ads Sidebar http://wordpress.org/extend/plugins/custom-ads-sidebar/ Float Left Right Advertising http://wordpress.org/extend/plugins/...t-advertising/ Google AdSense Plugin http://wordpress.org/extend/plugins/adsense-plugin/ In-Text Advertising http://wordpress.org/extend/plugins/wp-text2ad-lite/ Quick Adsense http://wordpress.org/extend/plugins/quick-adsense/ Simple Ads Manager http://wordpress.org/extend/plugins/simple-ads-manager/ WP Auto Post ADS http://wordpress.org/extend/plugins/wp-ads-auto-post/ Yepty - Pay Per Click Advertising. Monetize Blog and SkyRocket Income with Relevant Contextual Ads http://wordpress.org/extend/plugins/yepty/ Ad Injection http://wordpress.org/extend/plugins/ad-injection/ Admin Tools Admin Management Xtended http://wordpress.org/extend/plugins/...ement-xtended/ Adminimize Plugin http://wordpress.org/extend/plugins/adminimize/ AIO Cache &#x26; Performance http://wordpress.org/extend/plugins/aio-cache/ Akismet Plugin http://wordpress.org/extend/plugins/akismet/ Analytics360 http://wordpress.org/extend/plugins/analytics360/ Audit Trail http://wordpress.org/extend/plugins/audit-trail/ Ban User By IP http://wordpress.org/extend/plugins/ban-user-by-ip/ Codepress Admin Columns http://wordpress.org/extend/plugins/...admin-columns/ Count per"
    },
    {
      "fileName": "2013-05-13-performance-and-development-review-template.md",
      "slug": "performance-and-development-review-template",
      "title": "Performance and Development Review Template",
      "date": "2013-05-13T11:50:25.000Z",
      "built_excerpt": "Performance and Development reviews are an important aspect of everyone's career where ever you happen to work. We needed to provide standardised reports that were kept in a staff members file. Here's an example: Performance and Development Review {align=\"center\"} Name of person being reviewed: Dave T. Producer Reviewed by: Dave Manager &#x26; Sarah Manager Date: 11^th^ January 2028 Review Notes: *Discuss areas that were of note in the review. *Focus on relevant details related to their work* * How has the staff member performed since the last review? Any changes in roles &#x26; responsibilities? Discuss at length the current roles &#x26; responsibilities including areas that have &#x26; haven't met expectations of both the person being reviewed and what is expected from the role. Discuss any boundaries inherent in the role such as managers &#x26; sub-ordinates Discuss interactions with other members of the business &#x26; stakeholders How is communication amongst peers,"
    },
    {
      "fileName": "2014-12-05-syncing-with-apple-iphone-without-itunes-and-it-actually-works.md",
      "slug": "syncing-with-apple-iphone-without-itunes-and-it-actually-works",
      "title": "Syncing with Apple iPhone without iTunes — and it actually works!",
      "date": "2014-12-05T20:05:04.000Z",
      "built_excerpt": "Yesterday I've spent like 7 hours trying to upload music and videos to my iPhone. Nice going Apple, you put more effort into making the device impossible to work with, instead of solving known issues. Anyways, I finally did get it working, and it works really, really well. There were actually several methods I found to work, but only this one doesn't freeze. The software is called IMTOO iPhone Computer Transfer. Basically, what you do is connect your iPhone via USB and voila — the software sees your phone and automatically creates the music and video directories. There are couple of catches though. First of all, the software isn't free - the license costs $30. And although I did buy it, I got a refund for some reason the next morning. Without the license, you are limited to 10 file transfers at a single time. You can manually add as"
    },
    {
      "fileName": "2014-12-05-what-clients-want.md",
      "slug": "what-clients-want",
      "title": "What Clients Want",
      "date": "2014-12-05T14:54:31.000Z",
      "built_excerpt": "A potential client calls and wants a website, as a web developer you are more then happy to help. You show them your work, explain how your work is better then the rest and sell the person on the importance of Web Standards. Do you think that a client wants to hear all about Web Standards? Most likely they do not. They do want to here how you are going to make there website a success. This does not mean that Web Standards are not important or that you should not follow them and yes you should tell your clients that you build websites using proper coding. But this is what they expect from a web developer, otherwise they would be trying to build a website on there own. A web developer should be responsible for explaining to a potential client what it takes to make a website successful before"
    },
    {
      "fileName": "2014-12-30-building-the-creative-business.md",
      "slug": "building-the-creative-business",
      "title": "Building the Creative Business",
      "date": "2014-12-30T08:19:17.000Z",
      "built_excerpt": "Building the Creative Business is a management course aimed at entrepreneurs operating within the creative industries. I attended at London Business Schoolwhere I learned about how to grow a business that is inherently complex and unpredictable due to the creative aspects involved. Ideas often don't work, challenges arise in trying to sell an idea and implementing that idea is often fraught with problems. Most new ventures fail within the first three years and most failures are related to poor management. The average life span of an entrepreneurial venture in this country is only 24 months. It's at this point that a poorly conceived business strategy begins to ship water. Building the Creative Business is an integrative programme that concentrates on the general management challenges facing founders and managers of creative businesses after the start-up. The course asks the following questions Is my vision realistic? How am I actually going to"
    },
    {
      "fileName": "2015-01-15-are-you-unique.md",
      "slug": "are-you-and-your-game-unique",
      "title": "Are you and your game unique?",
      "date": "2015-01-15T06:31:36.000Z",
      "tags": [
        "business",
        "career"
      ],
      "built_excerpt": "In a world of seemingly infinite choice of games and staff, how do you stand out? How can you differentiate your offering so that everyone wants it? How can you make it easier for people to find your needle in a global haystack? Why would someone employ you from a global talent pool of thousands of people? These are all things to consider if you're going to be successful at what you do; communication, experience and knowledge can help guide your way through this chaotic landscape and achieve your goals."
    },
    {
      "fileName": "2015-01-15-recommended-read-small-is-new-big-seth.md",
      "slug": "recommended-read-small-is-the-new-big-seth-godin",
      "title": "Recommended Read - Small is the New Big - Seth Godin",
      "date": "2015-01-15T22:23:54.000Z",
      "tags": [
        "read me"
      ],
      "built_excerpt": "For me, even though this book is a few years old the title of Seth's book \"Small is the New Big\" sums up the changes that are happening throughout the Games Industry and the global economy where new, small companies are stealing the march on the bigger slumbering giants and making a real difference. This book is a collection of the best of Seth's blog posts that really capture the essence of what was going off in the world where people were people have more choice and ways to spend their time &#x26; money. The series of short stories make this easily digestible and great for filling the odd moment or too. I thoroughly enjoyed reading through the myriad of short stories in this book and I have learned a lot from it. It has changed my perspective on a lot of aspects of business and truly opened my eyes"
    },
    {
      "fileName": "2015-01-16-finishing-is-hard.md",
      "slug": "finishing-your-video-game-production-is-hard",
      "title": "Finishing Your Video Game Production is Hard",
      "date": "2015-01-16T20:45:46.000Z",
      "tags": [
        "production"
      ],
      "built_excerpt": "Every new project starts out exciting and fun. Then it gets harder and less fun, until it hits a low point-really hard, and not much fun at all. And then you find yourself asking if the goal is even worth the hassle. Are you a finisher? You're probably at Alpha and the hard work really starts now, it's time to stop tinkering, tweaking and adding features and it's time to ship it. Remember, the later in the project you add a feature the more it costs and the riskier it is. Remember that feature that you added in Month 1? It's been well and truly tested against everything else in the game, the new feature you added this morning is just waiting to explode. Post Alpha - resist change. Test it, fix it, balance it, polish it and you're done. Save your ideas for the next one, it'll be bigger"
    },
    {
      "fileName": "2015-01-17-7-of-my-favourite-games-industry-rss.md",
      "slug": "7-of-my-favourite-games-industry-rss-feeds",
      "title": "7 of my favourite Games Industry RSS Feeds",
      "date": "2015-01-17T06:22:09.000Z",
      "tags": [
        "read me"
      ],
      "built_excerpt": "I spend a lot of my time keeping in touch with what's going off in the Games Industry and I thought it worthwhile sharing 7 of my favourite Games Industry RSS Feeds to keep you all up-to-date. I personally subscribe to these via Google Reader, which I find to be an excellent way to keep everything in 1 place and really get the most out of my valuable time. I'd recommend taking this habit up if you haven't already. Develop Online - This is a little bit of a cheat as Develop splits it's feeds into 3 topics: regular, Blog and Feature so you can choose which is best for you. I tend to go for all 3 as it's always a fantastic read and much of the content appears way ahead of it's paper variant through the post. I like seeing people I know with their names up there"
    },
    {
      "fileName": "2015-01-18-10000-hours-to-success.md",
      "slug": "10000-hours-to-success-as-a-game-developer",
      "title": "10,000 hours to success as a game developer",
      "date": "2015-01-18T19:57:20.000Z",
      "tags": [
        "career"
      ],
      "built_excerpt": "In 2008, Gladwell's book \"Outliers: The Story of Success\" repeatedly mentions the \"10,000-Hour Rule\", claiming that the key to success in any field is, to a large extent, a matter of practicing a specific task for a total of around 10,000 hours. This equates to 1,250 working days, or 5 working years of focus on your core skill. Is this how long it took you to get to call yourself a successful? I certainly wonder just how much of anyone's skill or experience is relevant anymore. I believe only the last 5 years is relevant to what you do as the rest is just old hat and knowledge that can be easily achieved by someone chasing your heels. The kicker is, it can all disappear in an instant for no apparent reason."
    },
    {
      "fileName": "2015-01-18-weakest-link.md",
      "slug": "weakest-link-be-a-better-game-developer",
      "title": "Weakest Link - Be A Better Game Developer",
      "date": "2015-01-18T11:26:13.000Z",
      "tags": [
        "business",
        "career"
      ],
      "built_excerpt": "Has your business hit a glass ceiling? Most businesses are formed by a core set of individuals who come together at the beginning to make their collective dream come true but are they limiting your potential? Business roles arise and distil over time placing more specialised demands on your skills. Operations Manager, Creative Director, Technical Director, Art Director, Finance Director, Development Director, Managing Director, Business Development, Human Resources, IT, Marketing etc. all grow in significance as your business grows. In the early days one person will perform multiple roles at once, the roles are typically allocated based on relative merit, e.g., the more creative person takes on the creative roles such as creative director, the more logical person becomes the business manager. What happens later is that the business demands more than one person's potential enables them to deliver and the business hits a glass ceiling. Your business can"
    },
    {
      "fileName": "2015-01-19-15-seconds-of-fame.md",
      "slug": "15-seconds-of-fame",
      "title": "15 seconds of fame",
      "date": "2015-01-19T09:33:15.000Z",
      "built_excerpt": "\"In the future, everyone will be world-famous for 15 minutes.\" - Andy Warhol, 1968 Time has become compressed, 15 minutes is a long time now. Move fast or get left behind. The take away here is that everything has a much shorter lifetime now. Recognise that your job won't be for life, your game will be forgotten within 2 months of launch, 10hrs of gameplay is a lifetime, even the massive investment in a typically massively multiplayer online game will only last 3 years. Things change rapidly and you need to be prepared with your next successful venture, always think ahead, always expect change, never be complacent."
    },
    {
      "fileName": "2015-01-19-do-you-connect-with-your-audience.md",
      "slug": "do-you-connect-with-your-video-game-audience",
      "title": "Do you connect with your video game audience?",
      "date": "2015-01-19T19:07:50.000Z",
      "built_excerpt": "The relationship between games and their audience has changed over the years, thanks to the internet we're now able to reach out and touch them directly. This relationship is precious and much more important than just \"cutting out the middleman\" to make more money. There's something more valuable at stake. Do you know what it is? I remember when all this was fields… I'd like to start with a bit of history that the veterans can skip, it will hopefully give some background to how this all came about. Many years ago, the relationship between a developer and their game ended at the point it left your hands to go to the publisher and eventually make it's way to the duplication plant. We were often making the next game before the last one we'd poured our heart and sole into hit the shelves. This was a one way trip for"
    },
    {
      "fileName": "2015-01-20-book-agile-game-development-with-scrum.md",
      "slug": "book-agile-game-development-with-scrum",
      "title": "Book - Agile Game Development with SCRUM",
      "date": "2015-01-20T11:20:32.000Z",
      "tags": [
        "read me"
      ],
      "built_excerpt": "I recently connected with long time promotion and pioneer of Agile game development, Clinton Keith. We got talking and he pointed me in the direction of his book, Agile Game Development with SCRUM, which I'll be picking up soon. If you've read it, what did you think?"
    },
    {
      "fileName": "2015-01-20-thought-who-will-make-1st-carbon.md",
      "slug": "thought-who-will-make-the-1st-carbon-neutral-game",
      "title": "Thought – Who will make the 1st carbon neutral game?",
      "date": "2015-01-20T18:34:16.000Z",
      "tags": [
        "business",
        "development"
      ],
      "built_excerpt": "Hmmm…. this could be a tough one to work out. Imagine all of the power used; development hardware like PCs, food eaten, servers, travel for business and commuting, air-conditioning, manufacturing of the discs, manuals the list goes on and on. Don't forget everything at the publisher too. A killer title like God Of War 3, Modern Warfare 2 or Dead Redemption must have an astronomical footprint! Has anyone made a carbon neutral game? Wouldn't that be a great USP for your game? Who will be the 1st?"
    },
    {
      "fileName": "2015-01-21-thought-how-do-you-prefer-to.md",
      "slug": "thought-how-do-you-prefer-to-communicate",
      "title": "Thought - How do you prefer to communicate?",
      "date": "2015-01-21T18:33:23.000Z",
      "tags": [
        "communication"
      ],
      "built_excerpt": "There are many ways to communicate with people, what's your preference? I have to admit that I find telephone conversations the hardest, they fall between the disconnection of something like email or status updates and the 'proper' face-to-face meetings we have with people every day. Telephone conversations also tend to be one-to-one too, conference calls are a nightmare. There's no visual clues on when it's anyone's time to talk or how people are reacting. We all know It's entirely possible to hide behind emails, you can spend hours crafting every word, editing and re-editing until your happy. Meeting up with people is always fun, the spontaneity and interaction obviously surpasses everything else. I'd rather write a long, carefully crafted email or make a long distance journey to meet up than make a call. Everyone's different, do you have a preference?"
    },
    {
      "fileName": "2015-01-21-thought-you-need-slack-to-succeed.md",
      "slug": "thought-you-need-slack-to-succeed",
      "title": "Thought - You Need Slack To Succeed",
      "date": "2015-01-21T06:32:22.000Z",
      "tags": [
        "production"
      ],
      "built_excerpt": "Slack is the need to have capacity to adapt to change, it's no good running things on such a tight thread that the smallest wave capsizes your venture. How do you cope if someone is ill, how do you cope if there's a better way of doing something? How can you test that new fantastic idea you had?"
    },
    {
      "fileName": "2015-01-22-how-do-you-think.md",
      "slug": "how-do-you-think",
      "title": "How do you think?",
      "date": "2015-01-22T20:21:59.000Z",
      "tags": [
        "career"
      ],
      "built_excerpt": "When working with other people it's important to consider how they see things, as their view is often very different from your own perspective. In our world of game development there are, broadly speaking, 2 high level ways of looking at things. Firstly let me put things in perspective by explaining that I come from a background of logic that took me in the direction of Programming, which I found a good fit for me. I lived in a world of abstract languages, numbers and weird concepts and the 'creative' people just didn't understand. I arrogantly thought that anyone could draw pictures and it took raw talent to do what I was doing. These were the days when non-programmers were paid a pittance and weren't coveted by businesses. Those were the days when programming skill made for better games. At times it felt like Artists were from Venus, Programmers are"
    },
    {
      "fileName": "2015-01-22-opinion-small-businesses-stop-using.md",
      "slug": "opinion-small-businesses-stop-using-automated-replies",
      "title": "Opinion - Small businesses STOP USING AUTOMATED REPLIES!",
      "date": "2015-01-22T09:29:49.000Z",
      "tags": [
        "business",
        "connect",
        "fun",
        "opinion",
        "small"
      ],
      "built_excerpt": "If there's one thing I hate, it's receiving an automated reply from a small business, in particular one that's supposed to connect with me as a person. OK, I'll confess I'm having a rant about recruitment agencies, which is a pretty dangerous thing to do when you're looking for work. I have a special hatred for ones that pretend to be from a person. I know you're not there due to the nature and content of your email so the \"personal touch\" is just lost. There's no name, there's nothing. Also, PLEASE don't direct me to a web-site to fill in my details. If you're too busy to even bother to talk to me in the first place and find out about me then I know for definite you won't \"process\" my CV in a meaningful way and you definitely won't find me something that's relevant. There's one fundamental point,"
    },
    {
      "fileName": "2015-01-23-myth-of-silver-bullet-process.md",
      "slug": "myth-of-the-silver-bullet-game-production-process",
      "title": "Myth of the Silver Bullet Game Production Process",
      "date": "2015-01-23T07:15:42.000Z",
      "tags": [
        "production"
      ],
      "built_excerpt": "There is no one development process that fits all; Scrum, Prince, Lean, Extreme and whatever the current fashion is all have their place and can work but it's typically a hybrid that works best for you now. Things will change over time and the next team, platform, role or project may require an entirely different approach. Having an adaptable approach will make things smoother for you. Consider more formal methods for the meta-project such as milestone structure and operate an agile process within those. Consider \"beach head\" style changes to your production pipeline by introducing the new process to aspects of your project, e.g., introduce Scrum on your AI team before you unleash it. This way, you'll get to iron out the bugs and if things go well then at least you'll have trusted people on board when it comes to making the broader change. Consider running agile process for"
    },
    {
      "fileName": "2015-01-24-marketing-is-everyones-job.md",
      "slug": "marketing-your-video-game-is-everyones-job",
      "title": "Marketing your video game is everyone's job",
      "date": "2015-01-24T21:30:09.000Z",
      "tags": [
        "business",
        "development"
      ],
      "built_excerpt": "In a world of freelancers, contractors and small, tight development communities. Everyone is on the public face of their business and reputation. We are all constantly marketing something, be it our company or ourselves in one shape or another. Everything we do matters - your web-site, your comments in forums, the clothes you wear. It's about the message we convey in our appearance, our design, our gameplay, our technology, our ethics and most importantly our interactions with others. The sooner we realise this the better."
    },
    {
      "fileName": "2015-01-24-thought-what-does-quality-mean.md",
      "slug": "thought-what-does-quality-mean",
      "title": "Thought - What does Quality mean?",
      "date": "2015-01-24T06:30:53.000Z",
      "built_excerpt": "Without looking it up, what does quality mean to you in terms of how you feel about a game or service? On it's own it almost has no meaning, it needs to be preceded by something like \"low\" or \"high\" for it to make sense. Lets investigate it's true meaning. I think in every day life in the UK we actually omit the word \"high\" when we use it on it's own. \"I saw a quality film last night\", \"the customer service was quality\" all have to imply high quality as it doesn't make sense on it's own. A poor quality game is one that crashes all the time, looks shoddy and I think the most important one is that it lacks some decent gameplay. But what does it mean to you? Quality is an entirely subjective concept, I think it typically refers to our expectations, we feel something that"
    },
    {
      "fileName": "2015-01-25-do-you-have-resume-hook.md",
      "slug": "how-to-improve-your-video-game-developer-cv",
      "title": "How To Improve Your Video Game Developer CV",
      "date": "2015-01-25T20:36:36.000Z",
      "tags": [
        "career"
      ],
      "built_excerpt": "The way we apply for roles is still baked into the tradition of a paper CV along with the formatting that goes with it. Stop, think about it. Imagine your Resume sat in a pile with the recruiter shuffling through them at high speed, what makes your CV stand out? Do you get your key message across in the 1st few lines? Does the recruiter need to know your address and education first? Do we care about what you did 10 years ago? What are you offering? How do you fit the role you're applying for? Does it communicate you? If you're an artist or designer, show your creativity in your CV. Remember, if you're CV passes through an agency they will inevitably strip it of all of your contact information and ultimately re-format it."
    },
    {
      "fileName": "2015-01-25-thought-who-are-you-talking-to.md",
      "slug": "thought-who-are-you-talking-to",
      "title": "Thought - Who are you talking to?",
      "date": "2015-01-25T06:52:35.000Z",
      "tags": [
        "marketing"
      ],
      "built_excerpt": "Remember, you're always talking to your game players, the end audience. You're not talking to the middle-man, the Interviewer, Lead Designer, Journalist or your Manager. Think about who it is you're really addressing."
    },
    {
      "fileName": "2015-01-26-victorian-production.md",
      "slug": "victorian-video-game-production",
      "title": "Victorian Video Game Production",
      "date": "2015-01-26T08:18:06.000Z",
      "tags": [
        "production"
      ],
      "built_excerpt": "Is middleware replacing talented, creative developers? Is everything becoming mass produced? Our industries echos the early days of the industrial revolution where machines replaced talent and workers were inter-changeable, the cheapest people worked. During the industrial revolution businesses replaced highly skilled but slow workers with machines and cheap labour. The products were technically better and more cost effective but the skill was driven out of the business and interchangeable workers were brought in. New mediocre products appeared at a phenomenal rate as they were churned out and ultimately mass produced. At one point, almost 50% of cars on the planet were one specific model! In today's world, you could take this further by documenting the process and ship it and the machinery over to where the labour is cheapest. After all, anyone can do that job can't they? Non-native customer support call centres ring any bells? Echo's of this are"
    },
    {
      "fileName": "2015-01-26-why-fixed-9-5-time-is-bad-for-games.md",
      "slug": "why-fixed-9-5-working-time-is-bad-for-video-game",
      "title": "Why fixed 9-5 working time is bad for video game",
      "date": "2015-01-26T23:04:38.000Z",
      "tags": [
        "career",
        "production"
      ],
      "built_excerpt": "I often wander between favouring and hating the idea of a 9-5 culture at work. On the one hand it fits in nicely with a family life where we work to enjoy ourselves, we turn up, do some work, go home and disconnect and plug ourselves into an entirely separate life. On the other hand, what we do as game developers is a creative process, it requires thinking, passion and creativity that simply cannot be turned on and off at preset times of day. Imagine a day like this: 9am – be creative and passionate when you punch in 12pm – stop being creative and thinking about your art. 1pm – start being creative again, now, you've only got 4.5hrs remaining 5.30pm – stop thinking, park your creativity, go home, disconnect rinse and repeat. What happens if I'm on the brink of a brilliant discovery at 17:15 and I need"
    },
    {
      "fileName": "2015-01-27-book-review-linchpin-seth-godin.md",
      "slug": "book-review-linchpin-seth-godin",
      "title": "Book Review - Linchpin, Seth Godin",
      "date": "2015-01-27T20:01:51.000Z",
      "tags": [
        "read me"
      ],
      "description": "Seth Godin always inspires with his thought provoking writing and this book is now exception.",
      "built_excerpt": "I recently finished Seth Godin's recent book entitled \"Linchpin: Are You Indispensable? How to Drive Your Career and Create a Remarkable Future\" \"Why are some people easily outsourced, downsized, or freelanced into obscurity, while others have their pick of opportunities? In his most powerful book yet, Seth Godin argues that it's more essential than ever to become indispensable - to become a linchpin. Linchpins are the essential building blocks of great organizations: they invent, lead (regardless of title), connect others, make things happen, and create order out of chaos. They love their work and pour their best selves into it and turn each day into a kind of art - and, in today's world, they get the best jobs and the most freedom. Godin shows that the key to being indispensable is overcoming the fears that hold most of us back. If you have you ever found a shortcut"
    },
    {
      "fileName": "2015-01-27-quote-cherryhs-law-no-rule-should-be.md",
      "slug": "quote-cherryhs-law-no-rule-should-be-followed-over-a-cliff",
      "title": "Quote - Cherryh's Law: No rule should be followed over a cliff.",
      "date": "2015-01-27T10:40:34.000Z",
      "built_excerpt": "'nuff said."
    },
    {
      "fileName": "2015-01-28-leveraging-social-media-to-maximise-your-game-sales.md",
      "slug": "leveraging-social-media-to-maximise-your-game-sales",
      "title": "Leveraging Social Media To Maximise Your Game Sales",
      "date": "2010-08-28T06:45:16.000Z",
      "tags": [
        "business",
        "marketing"
      ],
      "built_excerpt": "Connecting with your audience is absolutely critical to the success of your game and is something you should take seriously and adopt a professional understanding. I'll cover some of the high level points here and provide how to maximise social media communication for different business types. Old Skool / New Skool Forums – old skool The old style way of interacting with \"consumers\" was to wait for them to discover some forums you had lurking around somewhere, on a discretely hosted web-site hoping they stumbled across them. Such forums still have a valuable role and can gain some feedback that you really need to know. A certain amount of \"know how\" is required to use the forums as registration is often required and users have to build up an internal reputation. The big bonus is they typically contain dedicated gamers used to giving feedback. Social Media – new skool The"
    },
    {
      "fileName": "2015-01-28-polarising-size-developers.md",
      "slug": "the-polarising-size-of-video-game-developers",
      "title": "The Polarising Size of Video Game Developers",
      "date": "2015-01-28T18:37:00.000Z",
      "tags": [
        "business",
        "career"
      ],
      "built_excerpt": "There used to be a time when developers of all sizes existed from small bedroom teams up to hundreds of people working on projects and everywhere in between. Developers of 40-100 people were not uncommon but all that has changed. At the moment there appears to be no middle ground, developers are either large in house teams or small external teams. 30-40 people seems to be the top end for an independent developer right now. Pico developers are the individual making iPhone games in their bedroom and becoming multi-millionaires over night. Nano developers a handful of people making small games, iterating them and moving onto new platforms. Micro developers are the core teams of 10+ that expand and contract based on the work available. Freelancers, contractors and outsourcing are the norm here. Much the same as the film industry but without the notion of the SPV to wrap each project"
    },
    {
      "fileName": "2015-01-29-improve-pitch-part-2-2.md",
      "slug": "how-to-improve-your-video-game-pitch-part-2",
      "title": "How To Improve Your Video Game Pitch - Part 2",
      "date": "2010-06-29T07:26:58.000Z",
      "tags": [
        "business",
        "conference",
        "pitch"
      ],
      "built_excerpt": "Recently I wrote an introduction to How To Improve Your Pitch for your game and I thought it worth writing a little bit more ahead of E3 Expo 2010. I'll follow on with a little more detail today. I covered the basics yesterday but I've been thinking about this quite a lot today and I wanted to share some more things that will hopefully prove useful. Funding When you're pitch is ready, ensure that it's appropriately funded because you can guarantee that the person you're pitching to will be forming a cost expectation based on platform, genre, target audience, feature set and quality level. When listening to pitches, it's disappointing to get to the funding part of any pitch and the money requested just doesn't stack up with the proposition. The cause for concern for most developers is that they think that the price is going to be too high"
    },
    {
      "fileName": "2015-01-30-opinion-graduate-training-poor.md",
      "slug": "opinion-video-game-developer-graduate-training-is-poor",
      "title": "Opinion - Video Game Developer Graduate Training is Poor",
      "date": "2010-04-01T09:31:53.000Z",
      "tags": [
        "career",
        "training"
      ],
      "description": "I believe that the graduates in UK universities need help or game development is going to be devoid of any well trained new talent.",
      "built_excerpt": "I'm typically passionate about making sure our beloved games industry is well stocked with talented, passionate individuals and we're not going to get them by just sitting back and waiting. I've been actively involved in the promotion of graduate recruitment for years now and I spotted this post that I prompted me to comment, but my comments were removed! So, I thought I'd share them here. Now, I'm an avid support of Train2Game because they're trying to do great things but I feel there's more to be done. Over the years, I've interacted with Universities, talked with students, attended graduate recruitment fairs and encouraged graduates I've employed to re-connect with their old universities all to try and improve everyone's chances. Soul Destroyers I've sadly also witnessed some failings of the people who have wrongly influenced graduates and polluted their minds, lowering expectations and just plain told them the wrong things."
    },
    {
      "fileName": "2015-01-31-how-to-achieve-some-focus.md",
      "slug": "how-to-achieve-some-focus",
      "title": "How To Achieve Some Focus",
      "date": "2015-01-31T20:48:07.000Z",
      "tags": [
        "production"
      ],
      "description": "We can all become lost on our way to achieving better video games, here's an idealistic view on how to improve your lot.",
      "built_excerpt": "I've been fortunate recently to take a break from video game development and really focus on what the next exciting stage of my career is going to be. I was overseas for a week recently in a remote area of Spain and I was taken away from the ubiquitous 24/7/365 connectivity with the world that we find ourselves part of everyday whilst trying to devote ourselves to video games. Back home internet access has become as important is breathing: wifi hotspots, fast data over 3G, netbooks and the iPhone mean that you're only ever seconds away from a rich world of content. Strip this away and you can really escape the noise and focus. Rare Internet Whilst away, connecting took a lot of effort, I had to head out quite a distance and find an open WiFi spot to hang off and connect with the outside world. At the time"
    },
    {
      "fileName": "2015-01-31-outsourcing-artwork-for-better-game-development.md",
      "slug": "outsourcing-artwork-for-better-game-development",
      "title": "Outsourcing Artwork for Better Game Development",
      "date": "2015-01-31T06:18:50.000Z",
      "tags": [
        "business",
        "outsourcing",
        "production"
      ],
      "description": "Guest David Tolley shares his best practice on setting up an outsource operation to maximise your game production.",
      "built_excerpt": "Hi, my name is David Tolley and I'd like to share my many years of experience and extensive knowledge regarding successfully setting up, managing and working with art outsourcing teams for computer and video games to throughout the world. Lot's of practical experience in delivering a wide range of art assets into game and managing external teams. Anyone new to (or interested in) the subject of outsourcing artwork for video game production should hopefully find what follows interesting. Why outsource When developing today's content hungry video games, there are several good reasons why choosing to work with external teams can be beneficial for developers. Cost savings and scalability are well documented, but increasingly the specialisation offered by some companies can be very attractive, and a great way of acquiring quality content quickly. Typically though, the primary reason for outsourcing is simply based on the amount of work in-house teams can"
    },
    {
      "fileName": "2015-02-01-move-to-new-server.md",
      "slug": "relocating-to-githubio",
      "title": "Relocating to Github.io",
      "built_excerpt": "I recently chose to take up the challenge of using github.io to host my long-standing blog. As I write, I've hopefully move all of my old posts over to Jekyll Markdown format by the magic of some scripts, some regex search &#x26; replace and some sheer effort. There's a few missing edges but I'm hopeful that keeping the content in Markdown format will mean I don't have to go through this pain again. Some of the images didn't make it through the process so I'll be churning through those in the coming days. Issues to solve: Missing images Random post dates &#x26; times Formatting/style issues lost in translation (Tables are going to be fun!)"
    },
    {
      "fileName": "2015-02-02-slow_mac.md",
      "slug": "high-windowserver-cpu-load-on-mac-macos-yosemite",
      "title": "High WindowServer CPU load on Mac MacOS Yosemite",
      "built_excerpt": "My MacBook Pro was recently suffering from 100% CPU pretty much all of the time and it took quite a while to solve them problem and breathe life back into my workhorse. TL;DR Disable Little Snitch status in menu bar. High WindowServer CPU My MacBook Pro seems to be suffering from high WindowServer CPU use when my machine isn't really doing anything. NOTE: During my investigations it appears that WindowServer CPU typically rises when something on your toolbar updates often. Here are the things I've tried, some of which come from other solutions posted around the web: Reduce transparency effects (in System Preferences > Accessibility under Display). This is the most highly reported solution to the problem but this didn't do anything for me. Switch \"Displays have separate Spaces off\" (in System Preferences > Mission Control). Switch Dashboard off. I don't use Spaces so this didn't do anything. Fix disk"
    },
    {
      "fileName": "2015-02-09-optimising-nginx-and-php-fpm.md",
      "slug": "optimising-nginx-php-fpm",
      "title": "Optimising NGINX & PHP-FPM",
      "date": "2015-02-09T21:38:50.000Z",
      "tags": [
        "NGINX",
        "php-fpm",
        "server",
        "unix",
        "performance"
      ],
      "built_excerpt": "Some notes from another round of performance optimisation of our server stack hosting our online platform that dramatically improved customer experience too. {% include toc.html %} The environment is a set of dedicated front end webhosts running NGINX &#x26; PHP-FPM all of which share a common disk volume for the web application itself. Services including MySQL, Memcached and Elastic Search run on seperate VMs to ease the load. Memcached exists in 2 forms: 1 - a dedicated session cache. 2 - a dedicated content cache. There are also bespoke Varnish caches sat infront of the servers to reduce load as much as possible. Each web VM is running 1 instant of NGINX forwarding to a local PHP-FPM farm of 2 local ports to improve core use and reduce latency. APC is running locally to improve PHP raw performance. In this configuration disk writes are very expensive as they lock the"
    },
    {
      "fileName": "2015-02-10-node_permissions.md",
      "slug": "fix-node-privileges-when-using-brew",
      "title": "Fix node privileges when using brew",
      "date": "2015-02-10T18:36:45.000Z",
      "description": "Fix node privilege issues when installed via brew. User will be constantly receive permission denied without this fix.",
      "built_excerpt": "Fix node privilege issues when installed via brew. User will be constantly receive permission denied without this fix. brew update brew upgrade brew cleanup brew install node brew link --overwrite node sudo chown -R whoami /usr/local"
    },
    {
      "fileName": "2015-08-29-top-5-website-performance---july-2015.md",
      "slug": "top-5-website-performance-july-2015",
      "title": "Top 5 Website Performance - July 2015",
      "date": "2015-08-29T18:36:45.000Z",
      "built_excerpt": "The site I write the code for, approvedfood.co.uk, on my own is consistently ranked Top 5 for performance in the UK! We beat eBay in July! IRUK 500: Web Performance Tracker for PageSpeed."
    },
    {
      "fileName": "2015-10-04-fixing-git-checkout-line-endings.md",
      "slug": "fixing-git-checkout-line-endings",
      "title": "Fixing Git checkout line endings",
      "date": "2015-10-04T18:36:45.000Z",
      "built_excerpt": "Recently when I was trying to run brew update on my Mac I was hitting errors that claimed I had uncommitted changes to my local brew and yet I hadn't made any changes. It didn't matter what I did, the changes would not revert and the errors would not go away. brew doctor revealed there were uncommitted changes so I followed the fix instructions to no avail. The problem turned out to be caused by line-endings that were being modified due to my local ~/.gitattributes. Making the global fix commonly recommended on stackoverflow.com didn't help, due to my local settings over-riding the settings. This didn't work: git config --global core.autocrlf false Reverting all local changes to brew after adding any necessary changes to ~/.gitattributes for the line-endings / binary: cd /usr/local/Library git rm --cached -r . git reset --hard origin/master git status git rm --cached -r . will remove all"
    },
    {
      "fileName": "2015-10-11-september-page-speed.md",
      "slug": "september-page-speed",
      "title": "September Page Speed",
      "date": "2015-10-09T18:36:45.000Z",
      "built_excerpt": "Hitting 100 on Google Pagespeed feels like it's impossible to hit right now. Despite a lot of effort to hit &#x26; maintain the current rating it's really hard to push past 97%. The main reason appears to be that Google down ranks speed when including external javascript libraries such as their own Google Analytics javascript include. It isn't possible to store GA.js locally as that would negate the metrics anyway. It would be possible to spoof the results by removing the javascript, getting a pagespeed score, then putting it back but that seems like a pointless exercise. So, 97 appears to be the best I can hope for until I find around it."
    },
    {
      "fileName": "2015-10-11-week-ending--11th-october.md",
      "slug": "week-ending-11th-october",
      "title": "Week ending - 11th October",
      "tags": [
        "web development",
        "docker",
        "react"
      ],
      "date": "2015-10-11T18:36:45.000Z",
      "built_excerpt": "There are a few things I discovered this week worth noting: Docker empty volumes Starting React Profile refresh Debug {% include toc.html %} Docker empty volumes Earlier in the week I moved all projects stored on my laptop into a new directory to get them out of my User directory to adhere to our internal project storage policy. [Docker] started behaving oddly, mounted volumes &#x26; paths were now empty on the host. The folder existed on the image but none of the files mapped from my laptop were there anymore. It took a long while to figure out that the issue was specific to the paths themselves. What I had completely forgotten was that [Docker] on Windows/Mac can only see below your home directory. Therefore mapping '~/projectX/www' worked fine but /projects/projectX/www didn't. I tried to symlink the folder beneath the ~ directory but that didn't work as Docker resolved the"
    },
    {
      "fileName": "2022-05-05-fostering-innovation-culture-continuous-improvement.md",
      "slug": "fostering-innovation-at-scale-how-to-build-a-culture-that-drives-continuous-improvement",
      "title": "Fostering Innovation at Scale: How to Build a Culture that Drives Continuous Improvement",
      "date": "2022-05-05T00:00:00.000Z",
      "tags": [
        "Innovation",
        "Organisational Culture",
        "Continuous Improvement",
        "Emerging Technologies"
      ],
      "categories": [
        "Organisational Strategy",
        "Leadership"
      ],
      "home_preview": "In today's fast-paced world, innovation isn't a luxury—it's a necessity. Discover how to build a culture that drives continuous improvement and fosters game-changing ideas at scale. From aligning innovation with business goals to leveraging emerging technologies like AI and IoT, this guide will show you how to future-proof your organisation and stay ahead of the competition. Ready to lead the charge? Dive in to learn how!",
      "built_excerpt": "In today's fast-paced world, innovation isn't a luxury—it's a necessity. Discover how to build a culture that drives continuous improvement and fosters game-changing ideas at scale. From aligning innovation with business goals to leveraging emerging technologies like AI and IoT, this guide will show you how to future-proof your organisation and stay ahead of the competition. Ready to lead the charge? Dive in to learn how!"
    },
    {
      "fileName": "2023-04-20-architectural-vision-digital-age.md",
      "slug": "architectural-vision-for-the-digital-age-guiding-business-transformation-with-robust-frameworks",
      "title": "Architectural Vision for the Digital Age: Guiding Business Transformation with Robust Frameworks",
      "date": "2023-04-20T00:00:00.000Z",
      "tags": [
        "Enterprise Architecture",
        "Digital Transformation",
        "Architectural Standards",
        "Scalability",
        "Business Strategy"
      ],
      "categories": [
        "Enterprise Architecture",
        "Technology Strategy"
      ],
      "home_preview": "In the digital age, navigating complex IT ecosystems requires more than innovation—it demands a clear architectural vision. Discover how robust architectural standards and roadmaps can help your organisation achieve scalability, optimise costs, and align technology with long-term business goals. Ready to future-proof your organisation? This guide will show you how to turn complexity into a competitive advantage!",
      "built_excerpt": "In the digital age, navigating complex IT ecosystems requires more than innovation—it demands a clear architectural vision. Discover how robust architectural standards and roadmaps can help your organisation achieve scalability, optimise costs, and align technology with long-term business goals. Ready to future-proof your organisation? This guide will show you how to turn complexity into a competitive advantage!"
    },
    {
      "fileName": "2023-07-01-from-gaming-to-enterprise-architecture-lessons-in-adaptability.md",
      "slug": "from-gaming-to-enterprise-architecture-lessons-in-adaptability",
      "layout": "post",
      "title": "From Gaming to Enterprise Architecture: Lessons in Adaptability",
      "date": "2023-07-01T00:00:00.000Z",
      "author": "Simeon Pashley",
      "tags": [
        "Gaming",
        "Enterprise Architecture",
        "Career Transition",
        "Adaptability"
      ],
      "home_preview": "What do gaming and enterprise architecture have in common? More than you might think. Discover how creative problem-solving, resilience, and transferable skills can transcend industries. In this article, I share my journey from crafting immersive gaming experiences to designing enterprise systems, offering lessons in adaptability that can help you thrive in any career transition. Ready to unlock your potential? Dive in and learn how to turn challenges into opportunities!",
      "built_excerpt": "What do gaming and enterprise architecture have in common? More than you might think. Discover how creative problem-solving, resilience, and transferable skills can transcend industries. In this article, I share my journey from crafting immersive gaming experiences to designing enterprise systems, offering lessons in adaptability that can help you thrive in any career transition. Ready to unlock your potential? Dive in and learn how to turn challenges into opportunities!"
    },
    {
      "fileName": "2023-09-24-zero-risk-actionable-strategies-migrating-outsourced-software-in-house.md",
      "slug": "zero-risk-and-actionable-strategies-for-migrating-outsourced-software-to-in-house-development",
      "title": "Zero Risk and Actionable Strategies for Migrating Outsourced Software to In-House Development",
      "date": "2023-09-24T00:00:00.000Z",
      "tags": [
        "In-House Development",
        "Software Migration",
        "Risk Management",
        "IT Strategy",
        "Scalability",
        "Operational Efficiency"
      ],
      "categories": [
        "Software Development",
        "IT Strategy",
        "Business Growth"
      ],
      "filename": "2023-09-24-zero-risk-actionable-strategies-migrating-outsourced-software-in-house.md",
      "home_preview": "Is outsourced software development limiting your business's growth? Discover zero-risk strategies to seamlessly transition to an in-house team, enhancing control, scalability, and innovation. Learn how to mitigate risks, optimize ROI, and empower your organization with our comprehensive guide. Take the first step towards a more agile and future-proof development strategy today!",
      "built_excerpt": "Is outsourced software development limiting your business's growth? Discover zero-risk strategies to seamlessly transition to an in-house team, enhancing control, scalability, and innovation. Learn how to mitigate risks, optimize ROI, and empower your organization with our comprehensive guide. Take the first step towards a more agile and future-proof development strategy today!"
    },
    {
      "fileName": "2023-12-12-introducing-agentic-generative-ai.md",
      "slug": "introducing-agentic-generative-ai-a-new-era-of-autonomous-innovation",
      "title": "Introducing Agentic Generative AI: A New Era of Autonomous Innovation",
      "date": "2023-12-12T00:00:00.000Z",
      "tags": [
        "Agentic AI",
        "Generative AI",
        "Digital Transformation",
        "Enterprise Innovation",
        "Automation"
      ],
      "categories": [
        "AI Innovation",
        "Digital Transformation"
      ],
      "home_preview": "Struggling to keep up with the pace of innovation in AI? Traditional systems can only do so much, leaving enterprises grappling with inefficiencies, bottlenecks, and a reactive approach to problem-solving. Enter Agentic Generative AI—a game-changing solution that redefines how organisations approach automation, decision-making, and innovation. With the power to not only generate insights but also autonomously act on them, Agentic AI is poised to revolutionise enterprise operations. Discover how this cutting-edge technology can help you streamline workflows, enhance customer experiences, and stay ahead of the competition. Read on to learn how Agentic AI can empower your organisation to thrive in today's fast-paced digital landscape.\n",
      "built_excerpt": "Struggling to keep up with the pace of innovation in AI? Traditional systems can only do so much, leaving enterprises grappling with inefficiencies, bottlenecks, and a reactive approach to problem-solving. Enter Agentic Generative AI—a game-changing solution that redefines how organisations approach automation, decision-making, and innovation. With the power to not only generate insights but also autonomously act on them, Agentic AI is poised to revolutionise enterprise operations. Discover how this cutting-edge technology can help you streamline workflows, enhance customer experiences, and stay ahead of the competition. Read on to learn how Agentic AI can empower your organisation to thrive in today's fast-paced digital landscape.\n"
    },
    {
      "fileName": "2024-01-15-automation-beyond-efficiency.md",
      "slug": "automation-beyond-efficiency-creating-value-through-ai-and-rpa",
      "title": "Automation Beyond Efficiency: Creating Value Through AI and RPA",
      "date": "2024-01-15T00:00:00.000Z",
      "tags": [
        "AI",
        "RPA",
        "Machine Learning",
        "Business Growth",
        "Process Automation",
        "Operational Risk"
      ],
      "categories": [
        "Automation",
        "Digital Transformation"
      ],
      "home_preview": "Automation isn't just about cutting costs anymore—it's about driving innovation and growth. Discover how AI, RPA, and ML are transforming business processes by enhancing decision-making, reducing risks, and unlocking new opportunities. If you're ready to move beyond basic efficiencies and harness the full potential of strategic automation, this guide is your roadmap to success!",
      "built_excerpt": "Automation isn't just about cutting costs anymore—it's about driving innovation and growth. Discover how AI, RPA, and ML are transforming business processes by enhancing decision-making, reducing risks, and unlocking new opportunities. If you're ready to move beyond basic efficiencies and harness the full potential of strategic automation, this guide is your roadmap to success!"
    },
    {
      "fileName": "2024-02-04-unlocking-value-search-ai.md",
      "slug": "unlocking-the-value-of-search-and-ai-a-non-technical-guide-to-modern-platforms",
      "title": "Unlocking the Value of Search and AI: A Non-Technical Guide to Modern Platforms",
      "date": "2024-02-04T00:00:00.000Z",
      "tags": [
        "Search",
        "AI",
        "eCommerce",
        "Product Discovery",
        "Personalisation"
      ],
      "categories": [
        "Technology",
        "Business Strategy",
        "eCommerce"
      ],
      "home_preview": "eCommerce success starts with smarter product discovery! Learn how AI-powered search platforms like Elastic and Google Vertex AI Search can transform your online store by delivering personalised results, dynamic product listings, and boosted best-sellers. If you're ready to create seamless shopping experiences and drive higher conversions, this guide will show you how to stay ahead of the competition!",
      "built_excerpt": "eCommerce success starts with smarter product discovery! Learn how AI-powered search platforms like Elastic and Google Vertex AI Search can transform your online store by delivering personalised results, dynamic product listings, and boosted best-sellers. If you're ready to create seamless shopping experiences and drive higher conversions, this guide will show you how to stay ahead of the competition!"
    },
    {
      "fileName": "2024-03-19-diving-deeper-into-agentic-generative-ai.md",
      "slug": "part-2-diving-deeper-what-ive-learned-about-agentic-generative-ai-since-my-first-post",
      "title": "Part 2: Diving Deeper: What I've Learned About Agentic Generative AI Since My First Post",
      "date": "2024-03-19T00:00:00.000Z",
      "categories": [
        "AI Innovation",
        "Digital Transformation"
      ],
      "tags": [
        "Agentic AI",
        "Generative AI",
        "Enterprise Use Cases",
        "AI Governance",
        "Emerging Trends"
      ],
      "filename": "2024-03-19-diving-deeper-into-agentic-generative-ai.md",
      "home_preview": "Three months ago, we explored the revolutionary potential of Agentic Generative AI—but the journey doesn't stop there. Since then, this groundbreaking technology has continued to evolve, unlocking new possibilities for enterprise innovation. In this post, we'll dive deeper into how agentic AI is transforming industries like supply chain management and cybersecurity, discuss solutions to governance and ethical concerns, and explore key trends shaping its future. Ready to take your understanding to the next level? Let's get started.\n",
      "built_excerpt": "Three months ago, we explored the revolutionary potential of Agentic Generative AI—but the journey doesn't stop there. Since then, this groundbreaking technology has continued to evolve, unlocking new possibilities for enterprise innovation. In this post, we'll dive deeper into how agentic AI is transforming industries like supply chain management and cybersecurity, discuss solutions to governance and ethical concerns, and explore key trends shaping its future. Ready to take your understanding to the next level? Let's get started.\n"
    },
    {
      "fileName": "2024-06-07-agentic-ai-practical-strategies.md",
      "slug": "the-ai-youve-been-waiting-for-how-to-make-agentic-ai-work-for-you",
      "title": "The AI You've Been Waiting For: How to Make Agentic AI Work for You",
      "date": "2024-06-07T00:00:00.000Z",
      "categories": [
        "AI Innovation",
        "Digital Transformation",
        "Enterprise Strategy"
      ],
      "tags": [
        "Agentic AI",
        "Generative AI",
        "AI Implementation",
        "Enterprise Solutions",
        "Iterative Learning"
      ],
      "filename": "2024-06-07-agentic-ai-practical-strategies.md",
      "home_preview": "Six months ago, I introduced the revolutionary concept of *Agentic Generative AI*. Three months later, I explored its deeper capabilities and emerging use cases. Now, it's time to take the next step: turning theory into action. In this post, I share new insights from the past three months, along with practical frameworks, real-world applications, and lessons learned for implementing agentic AI in enterprise environments. Whether you're looking to optimise IT operations, personalise customer experiences, or build self-managing workflows, this article will help you stay ahead. Let's dive into the future of AI innovation—today.\n",
      "built_excerpt": "Six months ago, I introduced the revolutionary concept of *Agentic Generative AI*. Three months later, I explored its deeper capabilities and emerging use cases. Now, it's time to take the next step: turning theory into action. In this post, I share new insights from the past three months, along with practical frameworks, real-world applications, and lessons learned for implementing agentic AI in enterprise environments. Whether you're looking to optimise IT operations, personalise customer experiences, or build self-managing workflows, this article will help you stay ahead. Let's dive into the future of AI innovation—today.\n"
    },
    {
      "fileName": "2024-12-12-google-gemini-enterprise.md",
      "slug": "google-gemini-20-the-catalyst-for-agentic-generative-ai-in-enterprises",
      "title": "Google Gemini 2.0: The Catalyst for Agentic Generative AI in Enterprises",
      "date": "2024-12-12T00:00:00.000Z",
      "tags": [
        "AI",
        "Google Gemini 2.0",
        "Enterprise AI",
        "Digital Transformation",
        "Agentic AI"
      ],
      "categories": [
        "AI Innovation",
        "Enterprise Technology"
      ],
      "filename": "2024-12-12-google-gemini-enterprise.md",
      "home_preview": "Struggling to keep your business ahead in today's fast-paced digital world? Google Gemini 2.0 is here to redefine enterprise AI with real-time insights, multimodal capabilities, and autonomous decision-making. Whether you're aiming to streamline operations, boost productivity, or elevate customer experiences, this groundbreaking technology is the ultimate solution. Dive into this article to discover how Gemini 2.0 can unlock your enterprise's full potential and future-proof your success.",
      "built_excerpt": "Struggling to keep your business ahead in today's fast-paced digital world? Google Gemini 2.0 is here to redefine enterprise AI with real-time insights, multimodal capabilities, and autonomous decision-making. Whether you're aiming to streamline operations, boost productivity, or elevate customer experiences, this groundbreaking technology is the ultimate solution. Dive into this article to discover how Gemini 2.0 can unlock your enterprise's full potential and future-proof your success."
    },
    {
      "fileName": "2024-12-31-generative-ai-predictions.md",
      "slug": "generative-ai-predictions-for-2025-stay-ahead-of-the-curve",
      "title": "Generative AI Predictions for 2025: Stay Ahead of the Curve",
      "date": "2024-12-31T00:00:00.000Z",
      "categories": [
        "AI Trends",
        "Digital Transformation",
        "Enterprise Innovation"
      ],
      "tags": [
        "Generative AI",
        "AI Predictions",
        "Enterprise Strategy",
        "Digital Transformation",
        "AI Readiness"
      ],
      "home_preview": "Generative AI is reshaping industries at an unprecedented pace. Are annual predictions enough to stay ahead? This post dives into key trends for 2025, highlighting why readiness and adaptability are critical for thriving in the AI-driven future. Learn how to prepare, adapt, and lead. Let’s shape the future together.\n",
      "built_excerpt": "Generative AI is reshaping industries at an unprecedented pace. Are annual predictions enough to stay ahead? This post dives into key trends for 2025, highlighting why readiness and adaptability are critical for thriving in the AI-driven future. Learn how to prepare, adapt, and lead. Let’s shape the future together.\n"
    },
    {
      "fileName": "2025-01-02-ai-driven-enterprise-development.md",
      "slug": "ai-driven-enterprise-development-lessons-from-hands-on-experience",
      "title": "AI-Driven Enterprise Development: Lessons from Hands-On Experience",
      "date": "2025-01-02T00:00:00.000Z",
      "tags": [
        "AI",
        "Agentic AI",
        "Enterprise AI",
        "Digital Transformation",
        "ChatGPT",
        "Gemini",
        "Claude",
        "DeepSeek"
      ],
      "categories": [
        "AI in Business",
        "Enterprise Technology"
      ],
      "home_preview": "Are you leveraging AI to its full potential in your enterprise? From coding tools like Cursor and Windsurf to advanced LLMs like ChatGPT, Gemini, and Claude, this article reveals the secrets to integrating AI responsibly, driving smarter outcomes, and navigating the complexities of agentic AI. Discover how strategy and preparation can transform your development workflows.",
      "built_excerpt": "Are you leveraging AI to its full potential in your enterprise? From coding tools like Cursor and Windsurf to advanced LLMs like ChatGPT, Gemini, and Claude, this article reveals the secrets to integrating AI responsibly, driving smarter outcomes, and navigating the complexities of agentic AI. Discover how strategy and preparation can transform your development workflows."
    },
    {
      "fileName": "2025-01-04-uk-business-ai.md",
      "slug": "real-world-ai-applications-for-uk-businesses-from-solopreneurs-to-scaling-enterprises",
      "title": "Real-World AI Applications for UK Businesses: From Solopreneurs to Scaling Enterprises",
      "date": "2025-01-04T00:00:00.000Z",
      "tags": [
        "AI",
        "UK Businesses",
        "Enterprise AI",
        "Digital Transformation",
        "Small Business AI"
      ],
      "categories": [
        "AI Applications",
        "Business Technology"
      ],
      "filename": "2025-01-04-uk-business-ai.md",
      "thumbnail": "/assets/img/2025/2025-uk-business-ai.jpg",
      "home_preview": "AI is transforming UK businesses of all sizes, levelling the playing field between tech giants and smaller enterprises. From automating tasks to driving personalised customer engagement, this article explores real-world applications and offers actionable insights for solopreneurs, micro-enterprises, and scaling companies. Discover how AI can simplify operations, boost productivity, and unlock new opportunities for growth.",
      "built_excerpt": "AI is transforming UK businesses of all sizes, levelling the playing field between tech giants and smaller enterprises. From automating tasks to driving personalised customer engagement, this article explores real-world applications and offers actionable insights for solopreneurs, micro-enterprises, and scaling companies. Discover how AI can simplify operations, boost productivity, and unlock new opportunities for growth."
    },
    {
      "fileName": "2025-01-06-ai-coding-assistants-lessons.md",
      "slug": "10-things-developers-of-all-skill-levels-may-be-surprised-to-learn-about-ai-coding-assistants",
      "title": "10 Things Developers of All Skill Levels May Be Surprised to Learn About AI Coding Assistants",
      "date": "2025-01-06 07:00",
      "categories": [
        "AI in Development",
        "Software Engineering",
        "Productivity Tools"
      ],
      "tags": [
        "AI Coding Assistants",
        "Large Language Models",
        "Software Development",
        "Prompt Engineering",
        "Digital Transformation"
      ],
      "filename": "2025-01-02-ai-coding-assistants-lessons.md",
      "thumbnail": "/assets/img/2025/dev_contrast.jpeg",
      "home_preview": "AI coding assistants are changing how developers work, but they come with surprising quirks and challenges. From understanding context windows to mastering prompt engineering, this post explores the lessons every developer-junior or expert-needs to know. Discover how to navigate these tools effectively and unlock smarter, faster workflows. Let's transform how you code with AI.\n",
      "built_excerpt": "AI coding assistants are changing how developers work, but they come with surprising quirks and challenges. From understanding context windows to mastering prompt engineering, this post explores the lessons every developer-junior or expert-needs to know. Discover how to navigate these tools effectively and unlock smarter, faster workflows. Let's transform how you code with AI.\n"
    },
    {
      "fileName": "2025-01-12-unlock-productivity-with-chatgpt.md",
      "slug": "unlock-productivity-with-chatgpt-time-saving-ai-strategies-for-busy-professionals-and-business-owners",
      "title": "Unlock Productivity with ChatGPT: Time-Saving AI Strategies for Busy Professionals and Business Owners",
      "date": "2025-01-12T00:00:00.000Z",
      "tags": [
        "AI",
        "Productivity",
        "ChatGPT",
        "Business Strategy",
        "Leadership"
      ],
      "categories": [
        "AI in Business",
        "Productivity Tools"
      ],
      "home_preview": "**Struggling to keep up with your growing to-do list?** ChatGPT is the AI-powered assistant transforming the way leaders and professionals work. From streamlining operations to freeing up time for strategic decisions, it's your key to smarter, faster productivity. Learn how to use ChatGPT for tasks, planning, and innovation-and unlock your business's full potential.",
      "built_excerpt": "**Struggling to keep up with your growing to-do list?** ChatGPT is the AI-powered assistant transforming the way leaders and professionals work. From streamlining operations to freeing up time for strategic decisions, it's your key to smarter, faster productivity. Learn how to use ChatGPT for tasks, planning, and innovation-and unlock your business's full potential."
    }
  ],
  "categories": [
    "Organisational Strategy",
    "Leadership",
    "Enterprise Architecture",
    "Technology Strategy",
    "Software Development",
    "IT Strategy",
    "Business Growth",
    "AI Innovation",
    "Digital Transformation",
    "Automation",
    "Technology",
    "Business Strategy",
    "eCommerce",
    "Enterprise Strategy",
    "Enterprise Technology",
    "AI Trends",
    "Enterprise Innovation",
    "AI in Business",
    "AI Applications",
    "Business Technology",
    "AI in Development",
    "Software Engineering",
    "Productivity Tools"
  ],
  "tags": [
    "business",
    "conference",
    "pitch",
    "contract",
    "royalties",
    "games",
    "career",
    "freelance",
    "guest",
    "programmer",
    "lean",
    "mvp",
    "production",
    "read me",
    "marketing",
    "design",
    "iphone",
    "Stress",
    "interview",
    "indie games",
    "fun",
    "manager",
    "redundancy",
    "development",
    "middleware",
    "unreal",
    "legacy",
    "history",
    "LinkedIn",
    "productivity",
    "pitching",
    "music",
    "business model",
    "episodic",
    "game",
    "ecommerce",
    "hosting",
    "website",
    "community",
    "facebook",
    "forum",
    "rss",
    "social media",
    "tweetdeck",
    "twitter",
    "communication",
    "connect",
    "opinion",
    "small",
    "training",
    "outsourcing",
    "NGINX",
    "php-fpm",
    "server",
    "unix",
    "performance",
    "web development",
    "docker",
    "react",
    "Innovation",
    "Organisational Culture",
    "Continuous Improvement",
    "Emerging Technologies",
    "Enterprise Architecture",
    "Digital Transformation",
    "Architectural Standards",
    "Scalability",
    "Business Strategy",
    "Gaming",
    "Career Transition",
    "Adaptability",
    "In-House Development",
    "Software Migration",
    "Risk Management",
    "IT Strategy",
    "Operational Efficiency",
    "Agentic AI",
    "Generative AI",
    "Enterprise Innovation",
    "Automation",
    "AI",
    "RPA",
    "Machine Learning",
    "Business Growth",
    "Process Automation",
    "Operational Risk",
    "Search",
    "eCommerce",
    "Product Discovery",
    "Personalisation",
    "Enterprise Use Cases",
    "AI Governance",
    "Emerging Trends",
    "AI Implementation",
    "Enterprise Solutions",
    "Iterative Learning",
    "Google Gemini 2.0",
    "Enterprise AI",
    "AI Predictions",
    "Enterprise Strategy",
    "AI Readiness",
    "ChatGPT",
    "Gemini",
    "Claude",
    "DeepSeek",
    "UK Businesses",
    "Small Business AI",
    "AI Coding Assistants",
    "Large Language Models",
    "Software Development",
    "Prompt Engineering",
    "Productivity",
    "Leadership"
  ]
}